{
    "kids": [
        {
            "parent": 13139638,
            "text": "All the ballroom dance competitions use this old, disliked software to organize and run the events. The guy who wrote it isn&#x27;t interested in making improvements, (and it can certainly use improvements) and is happy living off the income from people&#x27;s per event usage rights.  I am sure if something modern and regularly updated came out, it would get a lot of uptake. Thing is, the portion of it that runs during the event needs to be able to run offline since venues don&#x27;t always have reliable internet, and that also means you would be going to at least the first few events for support.. And your tests better be good, since time is of the essence if some does go wrong mid event. I thought about it, and decided I was not interested in dealing with all that when my job pays pretty well. Still, it&#x27;s a real opportunity.",
            "time": 1481336370,
            "type": "comment",
            "id": 13143623,
            "by": "ajepst"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13142584,
                                    "text": "I completely agree.<p>To your second paragraph, I would add that it&#x27;s hard for customers (and lawyers) to figure out what is &quot;good-enough&quot; in the legal setting. I&#x27;m a lawyer and there&#x27;s a lot of stuff you can find on the internet that I personally think is good enough (I would use it in my personal affairs because the risk of the missing edge cases being an actual problem is slim) but I wouldn&#x27;t be comfortable recommending it as a solution to a client because those missing edge cases are a real malpractice risk.<p>In the case of a logo, good enough is whatever the client thinks is good enough. In the case of a lot of legal solutions, good enough is often a murky risk&#x2F;reward calculation based on legal concepts the client may not understand completely.<p>I still think there&#x27;s enormous room for improvement, both in helping clients understand the concepts and the risks they&#x27;re taking, and also in providing better automated solutions.",
                                    "time": 1481325788,
                                    "type": "comment",
                                    "id": 13142774,
                                    "by": "ksdale"
                                }
                            ],
                            "parent": 13142475,
                            "text": "I feel like charging on an hourly basis is a common pattern in many industries that opens the doors to competition from startups with different pricing structures...as long as the startup can do everything in a manner compliant with the existing industry.<p>Logojoy, for instance, is an example of a service that supplants human labor with a single &quot;good-enough&quot; deliverable at a low price, and does so in a fraction of the amount of time. I imagine this would be much more difficult in legal settings, but LegalZoom seems to be alive and kicking, so it must be possible.",
                            "time": 1481324016,
                            "type": "comment",
                            "id": 13142584,
                            "by": "faitswulff"
                        }
                    ],
                    "parent": 13142180,
                    "text": "A lawyer friend of mine told me his firm doesn&#x27;t use software to check all the &quot;hereafter referred to&quot; are bound to their template and vice-versa. They instead have to print the document and go through it with a highlighter.<p>The firm charges their clients on an hourly basis, so they don&#x27;t really have an incentive to be more efficient.",
                    "time": 1481323052,
                    "type": "comment",
                    "id": 13142475,
                    "by": "amenghra"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13143435,
                                    "text": "So you don&#x27;t agree that &#x27;the person who represents themself has an idiot for a client&#x27;?",
                                    "time": 1481334658,
                                    "type": "comment",
                                    "id": 13143529,
                                    "by": "verbify"
                                }
                            ],
                            "parent": 13142802,
                            "text": "This is exactly correct. As a lawyer and a software developer, I long ago gave up on the idea of selling software to solve the problems of lawyers and&#x2F;or law firms. Lawyers tend to be terrible customers of technology, if for no other reason than that they have established completely backward incentives that reward inefficiencies and information deficits.<p>The only &quot;legal tech&quot; that can succeed (in my opinion) is the kind that eliminates the need for lawyers, but then you&#x27;re up against a different problem: people who think lawyers are magical wizards who can invoke spells to keep lawsuits and regulators at bay. It&#x27;s really hard to convince many people that they don&#x27;t need a lawyer, even though lawyers and law firms are almost never accountable for the advice they give.",
                            "time": 1481333151,
                            "type": "comment",
                            "id": 13143435,
                            "by": "nihonde"
                        }
                    ],
                    "parent": 13142180,
                    "text": "I have a family member who is a lawyer and who has a similar type of software setup. The biggest obstacle I notice in the legal industry is that many simply don&#x27;t care. They actively dismiss software as being unimportant even though they rely on it every day. It&#x27;s a very bizarre case of the legal industry hating the very industry that could help them.<p>Note: perhaps my experiences aren&#x27;t representative of the industry as a whole.",
                    "time": 1481326049,
                    "type": "comment",
                    "id": 13142802,
                    "by": "throw9322"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13142334,
                                    "text": "Exactly this. I wouldn&#x27;t code legal software for any amount of money.",
                                    "time": 1481335503,
                                    "type": "comment",
                                    "id": 13143575,
                                    "by": "ChristianGeek"
                                }
                            ],
                            "parent": 13142209,
                            "text": "And getting sued by lawyers, at that.",
                            "time": 1481321781,
                            "type": "comment",
                            "id": 13142334,
                            "by": "vornth"
                        }
                    ],
                    "parent": 13142180,
                    "text": "Make the slightest mistake and you are getting sued!",
                    "time": 1481320707,
                    "type": "comment",
                    "id": 13142209,
                    "by": "DavidPlumpton"
                },
                {
                    "kids": [
                        {
                            "parent": 13142365,
                            "text": "I&#x27;ve heard the same thing from multiple people attempting to build for the legal space.  Lawyers won&#x27;t pay for software to save time because that has a negative ROI for them.  OTOH they may pay for tools that helps them provide more services, bill more time, find more clients, or decrease the chance of mistakes.",
                            "time": 1481327277,
                            "type": "comment",
                            "id": 13142921,
                            "by": "derekdahmer"
                        },
                        {
                            "kids": [
                                {
                                    "parent": 13142466,
                                    "text": "I think he means pricing schemes are more simple when you go with a flat &quot;200$&#x2F;hour rate&quot;. Obviously it&#x27;s shit for the client since they have no idea how many hours will be spent on the case, but that&#x27;s not the lawyer&#x27;s problem.",
                                    "time": 1481326705,
                                    "type": "comment",
                                    "id": 13142861,
                                    "by": "dpc59"
                                }
                            ],
                            "parent": 13142365,
                            "text": "<i>(...) if they can bill their clients directly.</i><p>Can you explain what you mean? Letter generation etc is still usefull, I don&#x27;t see what billing has to do with it. They can still charge what they want to.",
                            "time": 1481322998,
                            "type": "comment",
                            "id": 13142466,
                            "by": "exceptione"
                        }
                    ],
                    "parent": 13142180,
                    "text": "I investigated doing a SaaS product in the legal space. One of the things I heard multiple times from lawyers is that they are more likely to buy a product if they can bill their clients directly. What you are talking about would not fall into that category. That doesn&#x27;t mean you couldn&#x27;t build a successful business, but I think it is important to understand that the market has different rules.",
                    "time": 1481322003,
                    "type": "comment",
                    "id": 13142365,
                    "by": "rpedela"
                },
                {
                    "kids": [
                        {
                            "parent": 13142340,
                            "text": "”Initial release: 1979; 37 years ago”<p>Quite amazing that it’s still around.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;WordPerfect#History\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;WordPerfect#History</a>",
                            "time": 1481330400,
                            "type": "comment",
                            "id": 13143200,
                            "by": "cpach"
                        },
                        {
                            "parent": 13142340,
                            "text": "George R. R. Martin uses WordStar:<p><a href=\"https:&#x2F;&#x2F;news.slashdot.org&#x2F;story&#x2F;14&#x2F;05&#x2F;14&#x2F;2019225&#x2F;game-of-thrones-author-george-r-r-martin-writes-with-wordstar-on-dos\" rel=\"nofollow\">https:&#x2F;&#x2F;news.slashdot.org&#x2F;story&#x2F;14&#x2F;05&#x2F;14&#x2F;2019225&#x2F;game-of-thr...</a>",
                            "time": 1481332381,
                            "type": "comment",
                            "id": 13143379,
                            "by": "makmanalp"
                        },
                        {
                            "parent": 13142340,
                            "text": "I still get virus &#x2F; malware emails from the AOL account of an IP lawyer I worked with in 2011 &#x2F; 2012. Also a blast from the past every time.",
                            "time": 1481323080,
                            "type": "comment",
                            "id": 13142477,
                            "by": "agf"
                        },
                        {
                            "parent": 13142340,
                            "text": "O.o Last time I had a consultation with my lawyer, he fired up One Note on his tablet.",
                            "time": 1481329946,
                            "type": "comment",
                            "id": 13143164,
                            "by": "mnrode"
                        },
                        {
                            "parent": 13142340,
                            "text": "<a href=\"http:&#x2F;&#x2F;wordperfect.com\" rel=\"nofollow\">http:&#x2F;&#x2F;wordperfect.com</a><p>My impression is that the legal industry is most of the reason why WP is still being used.",
                            "time": 1481325499,
                            "type": "comment",
                            "id": 13142734,
                            "by": "rhizome"
                        }
                    ],
                    "parent": 13142180,
                    "text": "Last time I had a consultation with my lawyer, she fired up WordPerfect.  There is a blast from the past.",
                    "time": 1481321796,
                    "type": "comment",
                    "id": 13142340,
                    "by": "starik36"
                },
                {
                    "kids": [
                        {
                            "parent": 13143572,
                            "text": "whats wrong with suing people ? if someone&#x27;s actions damaged you, would you want recompense ?",
                            "time": 1481335964,
                            "type": "comment",
                            "id": 13143599,
                            "by": "digler999"
                        }
                    ],
                    "parent": 13142180,
                    "text": "I really hope the tech talent talent doesn&#x27;t help lawyers sue people more effiently. What a waste. If you do, I truly hope lawyers are your customers.",
                    "time": 1481335424,
                    "type": "comment",
                    "id": 13143572,
                    "by": "ransom1538"
                },
                {
                    "parent": 13142180,
                    "text": "What about MyCase? <a href=\"https:&#x2F;&#x2F;www.mycase.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mycase.com&#x2F;</a><p>Not familiar with the space, but seems like what you are describing.",
                    "time": 1481332169,
                    "type": "comment",
                    "id": 13143361,
                    "by": "tompetry"
                },
                {
                    "parent": 13142180,
                    "text": "If I didnt have to risk becoming a lawyer, I&#x27;d love to combine some legal education with my programming and machine learning skills.",
                    "time": 1481327559,
                    "type": "comment",
                    "id": 13142943,
                    "by": "Joof"
                }
            ],
            "parent": 13139638,
            "text": "A family member is a lawyer in the Worker&#x27;s Comp, SS, and Family Law space. THE software for lawyers in this space is called A1 Law. It solves a lot of real problems lawyers in that space have (form letter generation, calendar integration, case management)... but it&#x27;s so slow to use new technologies. They advertise PalmOS integration. My family member has to have their own server in a closet running the server version of this so his team can use it! He has no idea how to manage a server, it&#x27;s absurd that he has to.<p>Everyone I know in law is dissatisfied with every part of their tech stack. If someone could come up with an integrated SaaS solution, and be SUPER careful about compliance... they would be printing money.",
            "time": 1481320466,
            "type": "comment",
            "id": 13142180,
            "by": "tmsam"
        },
        {
            "kids": [
                {
                    "parent": 13141263,
                    "text": "Seconded. Might even help us get out of the mindset of building things for other 20-somethings to replace their moms.",
                    "time": 1481328955,
                    "type": "comment",
                    "id": 13143063,
                    "by": "pj_mukh"
                },
                {
                    "kids": [
                        {
                            "parent": 13142218,
                            "text": "Great to hear.<p>I got so exited about the thread and it made me realise something very interesting which I turned into an essay. I call it looking for hidden problems underneat obvious solutions.<p><a href=\"https:&#x2F;&#x2F;medium.com&#x2F;black-n-white&#x2F;the-problem-with-problems-47ee63bb3511#.izv1qx34b\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;black-n-white&#x2F;the-problem-with-problems-4...</a>",
                            "time": 1481322550,
                            "type": "comment",
                            "id": 13142422,
                            "by": "ThomPete"
                        }
                    ],
                    "parent": 13141263,
                    "text": "Yep, I was reading through the discussion in your post and thought it would be interesting to shake that tree once more so I reposted the question.",
                    "time": 1481320772,
                    "type": "comment",
                    "id": 13142218,
                    "by": "takinola"
                },
                {
                    "kids": [
                        {
                            "parent": 13142771,
                            "text": "Well, I&#x27;m sure you would still get different people commenting due to one set being home on a Friday night one month and then a different set the next. I would prefer monthly, personally.",
                            "time": 1481326081,
                            "type": "comment",
                            "id": 13142803,
                            "by": "Styx-"
                        }
                    ],
                    "parent": 13141263,
                    "text": "Do the problems change rapidly enough for the monthly discussion to be radically different than before?<p>Perhaps Quarterly?",
                    "time": 1481325757,
                    "type": "comment",
                    "id": 13142771,
                    "by": "33W"
                },
                {
                    "parent": 13141263,
                    "text": "that is a great idea!",
                    "time": 1481315178,
                    "type": "comment",
                    "id": 13141538,
                    "by": "misiti3780"
                }
            ],
            "parent": 13139638,
            "text": "I posted a similar question last year great discussion there too. <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9799007\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9799007</a><p>I would suggest we make a monthly of these as they provide important insight into industries.",
            "time": 1481312889,
            "type": "comment",
            "id": 13141263,
            "by": "ThomPete"
        },
        {
            "kids": [
                {
                    "parent": 13140352,
                    "text": "Great questions. I worked on similar problems in the weather&#x2F;ag space for a few years, trying to minimize the time between data was acquired and data is ready to inform a decision.<p>We threw every rule out the window in the name of performance _when fetching raw data from external sources_. So we had weather station networks, NOAA forecast runs and NASA satellite data in a workable schema in our shop way faster than average.  Mix of C, PowerShell, Perl, and the nonstandard parts of T-SQL, highly parallelized, tricky but fast.<p>After the &quot;workable schema&quot; was established, the rules came back and we acted more responsibly. Smart instead of clever.<p>Ran this stuff all day long, getting every piece of data asap. Things that can only be calculated with a full day of data we poked and prodded the meteorologists to express in &quot;partial aggregates&quot;, which to me were just like the map steps before an EOD reduce.<p>Took a lot of mutual understanding and iterating but worth it in the end. When the ultimate data source (satellite or radar site for us) posted its last hour of data, we were 95% done with the day&#x27;s computation work. We do our last step, publish our numbers, and bam, Our ag clients have this stuff a day earlier than they are used to.",
                    "time": 1481315925,
                    "type": "comment",
                    "id": 13141637,
                    "by": "mmsmatt"
                },
                {
                    "parent": 13140352,
                    "text": "Check out Holistics.io (disclaimer: I&#x27;m a cofounder). While I can&#x27;t say we can solve all your listed problems above, we provide enough tooling on top of your DW to help you pre-process (clean, aggregate) them.<p><a href=\"https:&#x2F;&#x2F;www.holistics.io&#x2F;data-preparation&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.holistics.io&#x2F;data-preparation&#x2F;</a><p>And on the part about firehose data, you might already know this, but Kafka and their line of work should be aligned with what you&#x27;re after.",
                    "time": 1481333251,
                    "type": "comment",
                    "id": 13143445,
                    "by": "huy"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13142036,
                                    "text": "<p><pre><code>    guarantee worst-case linear time matching for any\n    number of expressions\n</code></pre>\nOr you could just use RE2: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;google&#x2F;re2&#x2F;wiki&#x2F;WhyRE2\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;google&#x2F;re2&#x2F;wiki&#x2F;WhyRE2</a><p>It&#x27;s open source, and match time is linear in the length of the input string.<p>(Disclosure: I work at Google on a different open source project)",
                                    "time": 1481323663,
                                    "type": "comment",
                                    "id": 13142549,
                                    "by": "cbr"
                                }
                            ],
                            "parent": 13141685,
                            "text": "We solved RegEx and can guarantee worst-case linear time matching for any number of expressions. We should talk!<p>www.watchful.io",
                            "time": 1481319210,
                            "type": "comment",
                            "id": 13142036,
                            "by": "jsingleton18"
                        }
                    ],
                    "parent": 13140352,
                    "text": "Check out Striim<p><a href=\"http:&#x2F;&#x2F;www.striim.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.striim.com&#x2F;</a><p>It&#x27;s a native streaming platform so your data will be cleansed, processed, scanned for outliers event-by-event rather than in batches. We have dozens of streaming connectors IT&#x2F;Enterprise&#x2F;Web data sources. We also support initial load for your firehose data. For unstructured data, we have support for RegEx based parsers.<p>Shoot me a message if you have any more questions. We have many big name users in Aerospace, Banking, Device manufacturing, and Logistics industries.",
                    "time": 1481316325,
                    "type": "comment",
                    "id": 13141685,
                    "by": "capkutay"
                },
                {
                    "parent": 13140352,
                    "text": "In my current job I use Informatica Cloud, which either by itself or in combination with other Informatica products can do these things. I have two main complaints about it:<p>1. The UX is subpar. It insists on running in only a single tab at a time, and attempts to open multiple tabs will instead override whatever it considers to be the master tab. This is a huge pain, because I often need to have a mapping workflow open in one window and some other relevant part of the application open in another. Instead I have to save, go find the thing I want, and go back. Another problem is that when working with data sources containing tons of fields, there&#x27;s no easy way to search.<p>2. It offers an expression language to perform some computational tasks, similar to what you&#x27;d find in Excel, but it&#x27;s hamstrung by a poor UI and a limited amount of functions. The built-in editor for expressions is really poor (see Tableau for an example of a great editor for a simple Excel-like language; it even has type linting) and, unless I&#x27;ve misunderstood something, you can&#x27;t declare any variables so you end up with huge nested expressions. There aren&#x27;t many functions available, so something as simple as removing whitespace ends up as lstrip(rstrip(foo)). In combination with no support for statements (or at least a let expression like in lisp) this makes any nontrivial data munging completely indecipherable.<p>I&#x27;ve looked around in this space and it seems like there are a variety of products, but the supplier of our main CRM will only support Informatica Cloud. I think that a company that can offer a product that does what you&#x27;ve said but makes a serious effort at UX could cause users to revolt and demand to use it! I know the joke is that Slack is just a pretty IRC with better UX... but that&#x27;s exactly why it has become so successful.<p>In terms of data munging, take a look at Microsoft&#x27;s Power BI. It&#x27;s visualization software but it has a nice data munging mode that, crucially, keeps track of all the changes you make and displays them in a linear format. This is great for getting a quick idea as to what was done with the data and is essential for doing reproducible data analyses. Unfortunately, Power BI also suffers from poor UX in insisting on tiny fonts and gray-on-gray palettes that are totally unreadable to anyone over 30.",
                    "time": 1481325012,
                    "type": "comment",
                    "id": 13142680,
                    "by": "muraiki"
                },
                {
                    "parent": 13140352,
                    "text": "I think startups Trifacta and Paxata are doing this or some aspects of this ... see a comparison (from 2015):  <a href=\"https:&#x2F;&#x2F;www.quora.com&#x2F;How-does-Paxata-compare-to-Trifacta\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quora.com&#x2F;How-does-Paxata-compare-to-Trifacta</a><p>I don&#x27;t know much about Paxata but I think Trifacta are well-regarded in industry and academia.  Trifacta founders worked on research &#x2F; open-source-? project Data Wrangler <a href=\"http:&#x2F;&#x2F;vis.stanford.edu&#x2F;wrangler&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;vis.stanford.edu&#x2F;wrangler&#x2F;</a> and turned it into Trifacta.<p>I don&#x27;t know much about either product in truth.",
                    "time": 1481319659,
                    "type": "comment",
                    "id": 13142088,
                    "by": "nwatson"
                },
                {
                    "parent": 13140352,
                    "text": "Integration platform as a service (iPaas) that can work with streaming, batch, and Big Data using a drag-n-drop UI e.g. <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=SfEuG7Dg_O8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=SfEuG7Dg_O8</a><p>Check out my company, SnapLogic: <a href=\"https:&#x2F;&#x2F;www.snaplogic.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.snaplogic.com&#x2F;</a>",
                    "time": 1481312070,
                    "type": "comment",
                    "id": 13141155,
                    "by": "robinhowlett"
                },
                {
                    "parent": 13140352,
                    "text": "In my limited experience this is science, art, and craft. I don&#x27;t think there is a specific method to do this in an automated way.",
                    "time": 1481311435,
                    "type": "comment",
                    "id": 13141076,
                    "by": "wslh"
                },
                {
                    "parent": 13140352,
                    "text": "This is a area I like to work.<p>I have seen local companies working for months&#x2F;years to finally use his BI package but the trouble at the step 1 is big (and also, to put the data in a &quot;nice&quot; schema).<p>The problem is that enter in this space is hard. Years ago I was at a company that have a niche product (in foxpro) for this kind of task, and I have dreamed about build something like this based in my experience, but get the funding for this kind of &quot;boring&quot; task is hard (more in my country, Colombia).<p>P.D: If wanna help, we can talk. I can&#x27;t give a magical solution but at least I find this kind of &quot;boring&quot; jobs compelling ;)",
                    "time": 1481314436,
                    "type": "comment",
                    "id": 13141445,
                    "by": "mamcx"
                },
                {
                    "parent": 13140352,
                    "text": "One thing you don&#x27;t really mention here, but it&#x27;s mentioned a lot in the comments, is the data extraction piece. Is data extraction a pretty solved problem at this point, and it&#x27;s really the intelligent cleaning, transforming, then warehousing &#x2F; analysis that&#x27;s the unsolved issue?",
                    "time": 1481320650,
                    "type": "comment",
                    "id": 13142200,
                    "by": "zilchers"
                },
                {
                    "parent": 13140352,
                    "text": "What I envision a solution to be like, would be something like an configurable&#x2F;codeable OpenRefine (was Google Refine) with streaming ingestion&#x2F;extraction, with a validation engine&#x2F;parsing engine (something more elegant than regex, but you can drop into that if necessary) and maybe a pluggable event processor (i.e. a Spark or Flink). I would love to work on such a problem, and solve it.",
                    "time": 1481315047,
                    "type": "comment",
                    "id": 13141515,
                    "by": "asragab"
                },
                {
                    "parent": 13140352,
                    "text": "Have you looked into Snowflake? Seems like their solution satisfies most of your requirements, including native ingestion of unstructured data. The one caveat is that all source data must first be loaded to S3. <a href=\"https:&#x2F;&#x2F;www.snowflake.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.snowflake.net&#x2F;</a>",
                    "time": 1481325640,
                    "type": "comment",
                    "id": 13142752,
                    "by": "maxlamb"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13141255,
                                    "text": "I&#x27;m not very familiar with the open source options since after many years of coding this by hand, I work with what I know.  I am a developer that works with data, not a Data Scientist, so I don&#x27;t really know the lingo and whatever hipstery terms people are using these days.  I will answer to the best of my ability, though (mostly for my sake, who knows if this will be useful):<p>Cleaning:<p>Open Refine seems to be the best product in this category.  I haven&#x27;t used anything but my own tools to do this before, so I can&#x27;t really offer any advice.<p>Warehousing:<p>My understanding is that this is just a fancy way to talk about a database with a schema designed for analytics.  There are many open source databases which do this very well, the one I use being Cassandra (and&#x2F;or KairosDB), though it is also likely the one that is hardest to use.  For a beginner, you might want to refer to this SO answer: <a href=\"http:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;8816429&#x2F;is-there-a-powerful-database-system-for-time-series-data\" rel=\"nofollow\">http:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;8816429&#x2F;is-there-a-powerf...</a><p>Data processing&#x2F;collection:<p>This is something that is incredibly dependent on the data sources, so I likely can&#x27;t tell you anything that will help.  Most of my data sources I&#x27;ve worked with have been internally sourced log files, messages from ZMQ, or CSV data - you might be working with something far different though, since there are lots of public data sets and such which are common.  Ideally, this would be integrated into the tools that you are using to clean the data, but I don&#x27;t know if that exists.<p>Handling input from many different sources at different rates is not a very hard problem to solve if your system is build correctly - you could for example run a daemon for each data source which will populate the database when there is new data available, then send a message off to the processing engine, which will integrate the data into whatever reports you are running.<p>Specifically for a use case of a hedge fund, the reports could be triggered by a message which is sent when the new data is available, and processing could be done in parallel in Lambda or similar dependent on need to get a nearly instant return, enabling nearly real-time reporting.",
                                    "time": 1481316155,
                                    "type": "comment",
                                    "id": 13141660,
                                    "by": "danielvinson"
                                }
                            ],
                            "parent": 13141137,
                            "text": "I&#x27;m new to this sort of thing - can you elaborate on some of the open-source options for those steps?",
                            "time": 1481312800,
                            "type": "comment",
                            "id": 13141255,
                            "by": "frakkingcylons"
                        }
                    ],
                    "parent": 13140352,
                    "text": "There are good open source options for each step here - is the solution you are looking for just a UI and easy install process?  Or would your ideal solution make all of the decisions for you - data structure and format, which data is&#x2F;isn&#x27;t valid, what output options are possible, managing server resources, etc.?",
                    "time": 1481311894,
                    "type": "comment",
                    "id": 13141137,
                    "by": "danielvinson"
                },
                {
                    "parent": 13140352,
                    "text": "Have you tried Quandl? They solve some of those problems for financial data.",
                    "time": 1481312396,
                    "type": "comment",
                    "id": 13141198,
                    "by": "rpedela"
                },
                {
                    "parent": 13140352,
                    "text": "I&#x27;ve actually been working on something like this for a while now, and found your comment about proprietary data interesting.  Would this mean that hosting this data in a third party server is out of the question for you? OK with NDA?",
                    "time": 1481321847,
                    "type": "comment",
                    "id": 13142351,
                    "by": "davidjairala"
                },
                {
                    "parent": 13140352,
                    "text": "I&#x27;ve been working on similar issues, and developing towards solving them. I work with mixed schemas, handle user defined processes inline and allow you to gather stats and show everything as it streams + accommodate a workflow. I&#x27;m only 1 month from launching my beta and want to give away licenses to people who can use it and give me feedback. here is the landing page for it: <a href=\"http:&#x2F;&#x2F;ohm.ai\" rel=\"nofollow\">http:&#x2F;&#x2F;ohm.ai</a> OH and it uploads nothing... it all runs in your browser anthony dot aragues at gmail dot com if interesed",
                    "time": 1481319190,
                    "type": "comment",
                    "id": 13142034,
                    "by": "anthonyaragues"
                },
                {
                    "parent": 13140352,
                    "text": "Splunk provides this kind of solution and it&#x27;s pretty amazing :)",
                    "time": 1481316216,
                    "type": "comment",
                    "id": 13141669,
                    "by": "adladl2012"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13140529,
                                            "text": "Great question, but I don&#x27;t see this much different from other industries or companies with millions or billions of dollars at stake. They don&#x27;t all roll their own software inhouse, and most companies (hedgefunds or not, small or even large) simply cannot afford to for financial and commercial risk-management reasons unless they can justify the software truly being a core competitive competency.<p>The same line of inquiry has been evaluated for most 3rd party software that companies rely on. For this specific instance of data collection and cleaning, I&#x27;m imagining it&#x27;s not going to be a much different calculus, although perhaps you&#x27;ll see a higher percentage of firms choosing to roll their own if they have the chops and pockets (e.g. Two Sigma, Bridgewater, Goldman Sachs, etc.).<p>I will note that there are commercial mechanisms firms could try to implement to try to limit the downsides in case something like this happens: warranty &amp; damages provisions, and insurance are two come that spring to mind. I&#x27;m sure there are numerous other considerations in the age-old &quot;build or buy&quot; cost-benefit analysis.",
                                            "time": 1481308489,
                                            "type": "comment",
                                            "id": 13140706,
                                            "by": "otoburb"
                                        }
                                    ],
                                    "parent": 13140502,
                                    "text": "And what about the risk of 3rd party dev error which will throw several funds at once out of the business?",
                                    "time": 1481307303,
                                    "type": "comment",
                                    "id": 13140529,
                                    "by": "juskrey"
                                }
                            ],
                            "parent": 13140381,
                            "text": "Provided they can deploy the 3rd party solution onsite (aka &quot;on premise&quot;), this wouldn&#x27;t be seen as a &quot;huge risk&quot;.",
                            "time": 1481307132,
                            "type": "comment",
                            "id": 13140502,
                            "by": "otoburb"
                        },
                        {
                            "parent": 13140381,
                            "text": "Yes.",
                            "time": 1481329791,
                            "type": "comment",
                            "id": 13143148,
                            "by": "wintermute42"
                        }
                    ],
                    "parent": 13140352,
                    "text": "Will hedge funds take such a huge risk of using 3rd party centralized (or centrally developed) data management system?",
                    "time": 1481306319,
                    "type": "comment",
                    "id": 13140381,
                    "by": "juskrey"
                },
                {
                    "kids": [
                        {
                            "parent": 13140420,
                            "text": "The Palantir solution, from what I understand, boils down to &quot;lots of consultants (FDEs) writing glue code&quot;.",
                            "time": 1481319054,
                            "type": "comment",
                            "id": 13142018,
                            "by": "dbuxton"
                        },
                        {
                            "parent": 13140420,
                            "text": "For $$$",
                            "time": 1481318281,
                            "type": "comment",
                            "id": 13141936,
                            "by": "seppin"
                        }
                    ],
                    "parent": 13140352,
                    "text": "I think Palantir provides solutions to this problem",
                    "time": 1481306579,
                    "type": "comment",
                    "id": 13140420,
                    "by": "flamesnare3"
                },
                {
                    "parent": 13140352,
                    "text": "Hey - we did this. We should talk. Well not #2 exactly...but we solve most of your problems.<p>www.watchful.io",
                    "time": 1481319122,
                    "type": "comment",
                    "id": 13142027,
                    "by": "jsingleton18"
                },
                {
                    "time": 1481313402,
                    "id": 13141328,
                    "parent": 13140352,
                    "deleted": true,
                    "type": "comment"
                },
                {
                    "time": 1481306264,
                    "id": 13140377,
                    "parent": 13140352,
                    "deleted": true,
                    "type": "comment"
                }
            ],
            "parent": 13139638,
            "text": "Data management.<p>1) Cleaning the data as it comes in rather than in batches so we can use it sooner, invalid data is discarded, outlier detection, normalizing inputs etc....<p>2) Warehousing of the data with proper indexes so you can perform some advanced queries on unstructured data<p>3) Some data is sent in bulk at the end of day, some of the data is streamed in fire hose style.  How can we preprocess the fire hose data so that we don&#x27;t have to wait until the end of the day to parse it all.<p>4) Oh and all of this data is unstructured and comes from 75 different sources.<p>Soon the average hedge fund will have more people just cleaning and managing data than they do in quantitative research, dev ops, software development and trading.<p>Oh and lots of the data is considered proprietary so while AWS&#x2F;Azure, etc is fine, sending it to a third party to process is not.<p>TL&#x2F;DR\nHelp me, I&#x27;m drowning in data.  How do I get the time from when I acquire data to when I trade based on it down to a reasonable time frame, where reasonable is closer to hours rather than days&#x2F;weeks.",
            "time": 1481306095,
            "type": "comment",
            "id": 13140352,
            "by": "chollida1"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142231,
                            "text": "This sounds very like Redmine [0]. It&#x27;s ostensibly for project &quot;issues&quot; however it&#x27;s extremely customizable and all of the above are included in the default config and not much more. It sounds like if you removed about 2 default fields it&#x27;d be perfect for the ticketing system you describe above. Plus RSS + Notifications + a solid API.<p>[0] <a href=\"http:&#x2F;&#x2F;www.redmine.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redmine.org&#x2F;</a>",
                            "time": 1481328696,
                            "type": "comment",
                            "id": 13143041,
                            "by": "thomasdub"
                        },
                        {
                            "parent": 13142231,
                            "text": "A ticketing system is a tool to support a workflow, and any friction it creates with the preferred workflow is waste.<p>As is (consequently) friction it creates in changing the workflow as needs change.<p>Thats just the fundamental and immutable nature of the problem domain.",
                            "time": 1481321780,
                            "type": "comment",
                            "id": 13142333,
                            "by": "dragonwriter"
                        }
                    ],
                    "parent": 13141613,
                    "text": "The problem here seems to be that users&#x2F;customers insist on customizing any such app to death.<p>Personally, I think the optimal ticket system would have this data for each ticket:<p>* A unique, prefixed ticket # (JIRA gets this right)<p>* An assignee (like an email To:)<p>* A reporter (like an email From:)<p>* A one-line summary (like an email Subject:)<p>* A multi-line body (like an email body, but ideally with markdown)<p>* Attachments (like email attachments)<p>* History for edits of all of these (not like email!)<p>That&#x27;s it! It really is basically email, but with a unique ID, and editable with history instead of immutable with replies, and a decent UI, perhaps RSS + notifications.<p>Unfortunately, everybody else seems to think that their ticketing system should embody their vaguely defined and ever-changing workflow, prioritization, approval, and release management system, so they want to be able to add any number of possible statuses, approvals, workflows and and all the rest. Once you add that, you end up with another JIRA or ClearQuest or BugZilla, and the cycle repeats itself.",
                    "time": 1481320843,
                    "type": "comment",
                    "id": 13142231,
                    "by": "tacostakohashi"
                },
                {
                    "parent": 13141613,
                    "text": "I&#x27;ve been building support and dev&#x2F;ops ticketing systems for years and I still haven&#x27;t found a platform that suits all needs.<p>For my latest startup I went looking for a service desk tool. The key criteria was &quot;feels like email&quot;. The moment any alternative required a user signup just to lodge a support request, I ruled it out.<p>I ended up choosing Groove. I don&#x27;t recommended it. All ticketing systems suck, this one just sucked the least for my support desk.  Groove doesn&#x27;t extend to other ticket types, and it&#x27;s nowhere near as flexible or extensible as JIRA, and the mobile experience is horrible.  But it does &quot;feels like email&quot; for my customers better than every alternative you care to mention.",
                    "time": 1481327466,
                    "type": "comment",
                    "id": 13142938,
                    "by": "inopinatus"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13142173,
                                    "text": "I also have an idiosyncratic way of organizing this stuff, which is basically to use Emacs + mu4e to search my mail, and if I need to create order, write a new document from scratch. I have a coworker who does what you do, now that you mention it—he will take a series of email, dump it into Word and edit it until it is a useful document of some sort.<p>I still think there is something here though. Stack Overflow replaced message boards, which were basically HTML versions of mailing lists, and part of that was identifying the semantics of question, answer and comment and defining new operators and new expectations for them.<p>A wiki is a good approach but because it&#x27;s totally free-form, the user gets stuck doing the work of keeping things hygienic.<p>JIRA allows you to edit all the properties of a ticket whenever, but it generates such a huge cloud of email notifications in the process, it kind of disincentivises you from using it. And nobody is in the habit of rereading the page to see what is different since last time.",
                                    "time": 1481322108,
                                    "type": "comment",
                                    "id": 13142375,
                                    "by": "fusiongyro"
                                }
                            ],
                            "parent": 13141715,
                            "text": "The simplest solution to the &#x27;chronological pile-up problem&#x27; (nice name BTW) is a Wiki model, where replies are appended by default but the entire content can be edited if necessary. (C2 demonstrates this quite well.) For simple problems, conversations behave exactly the way they used to, but when it starts getting complex someone can go in and rearrange the conversation into a more logical form. This actually maps quite well to email: by default replies are appended to the bottom, but they can also be inserted inline (some mailing list etiquettes even demand this) or indeed the entire conversation can be rewritten. You&#x27;d probably want some sort of merge algorithm in case someone replies to an older email.<p>In fact, my usual approach to dealing with tickets&#x2F;issues&#x2F;emails which start to develop this problem is to make my own private copy of the thread and edit it in precisely this manner, though I&#x27;m the only one this benefits since it doesn&#x27;t get sent back upstream.",
                            "time": 1481320422,
                            "type": "comment",
                            "id": 13142173,
                            "by": "wolfgang42"
                        }
                    ],
                    "parent": 13141613,
                    "text": "I blogged recently about some problems I have with JIRA:<p><a href=\"http:&#x2F;&#x2F;www.storytotell.org&#x2F;constraints-and-semantics&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.storytotell.org&#x2F;constraints-and-semantics&#x2F;</a><p>In a nutshell, I argue that the problem with most ticket systems is that they do not constrain the domain enough, so they wind up having similar problems to email (sifting through a chronologically-ordered pile of text rather than structured, semantically-ordered information).<p>Your comments make me think the crux of the problem is that people want tickets to be like email and use email to manage them. I&#x27;m not sure you can ever overcome the &quot;chronological pile-up&quot; problem if you allow email as a user interface to ticketing.",
                    "time": 1481316565,
                    "type": "comment",
                    "id": 13141715,
                    "by": "fusiongyro"
                },
                {
                    "kids": [
                        {
                            "parent": 13141742,
                            "text": "Additional features: custom fields w&#x2F; user-chosen types: free text field, drop down list, etc.); time tracking (I spent n hours&#x2F;minutes on this ticket); these should be searchable.<p>Major feature that allows me to work around any shortcomings in your office: API access to everything and&#x2F;or database access (preferably direct read&#x2F;write access, but even if it&#x27;s just a downloadable .sql.gz it&#x27;s a huge benefit).<p>I&#x27;m probably not a typical user, though, FWIW.",
                            "time": 1481321784,
                            "type": "comment",
                            "id": 13142337,
                            "by": "jlgaddis"
                        }
                    ],
                    "parent": 13141613,
                    "text": "We&#x27;re in our first month of releasing Zammad [1] an open source Zendesk alternative with pretty neat features. You can check out some screenshots or a free 30 day trial oft our hosted solution on our commercial site [2]. I really like your feature ideas and will later create issues for them. Would be great if you add some too if you have more of them.<p>Full disclosure: I&#x27;m part of the maintainer staff.<p>[1] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;zammad&#x2F;zammad&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;zammad&#x2F;zammad&#x2F;</a>\n[2] <a href=\"https:&#x2F;&#x2F;zammad.com\" rel=\"nofollow\">https:&#x2F;&#x2F;zammad.com</a>",
                    "time": 1481316789,
                    "type": "comment",
                    "id": 13141742,
                    "by": "thorsteneckel"
                },
                {
                    "parent": 13141613,
                    "text": "how about using an app like Trello for that?",
                    "time": 1481325463,
                    "type": "comment",
                    "id": 13142727,
                    "by": "maxlamb"
                },
                {
                    "parent": 13141613,
                    "text": "What would a reasonable price for this product be for you?",
                    "time": 1481321723,
                    "type": "comment",
                    "id": 13142326,
                    "by": "davidjairala"
                }
            ],
            "parent": 13139638,
            "text": "A ticketing system that doesn&#x27;t sux (I like RequestTracker, but it shows its age). Top players are ridiculously overpriced.<p>My management style is like this: every task&#x2F;request is numbered, placed in a queue and assigned to a professional.<p>What I expect from my ticketing system:<p>- every manager should be able to assign tasks to someone and set the order they must be executed. He needs know what his team is doing and when they finish each task.\n - every professional should know what to do and what are the priorities.\n - everything is numbered and linked, all communication recorded.<p>Everything should be well integrated with email (please, don&#x27;t send me a notification email about an answer and an url, send me the f* answer). If I answer the email, everything goes into the system, I should be able to send commands to the system by email (for example, add a keyword in order to make it a comment instead of answering).",
            "time": 1481315703,
            "type": "comment",
            "id": 13141613,
            "by": "scardine"
        },
        {
            "kids": [
                {
                    "parent": 13141796,
                    "text": "I am in same boat. There is a YC startup simplelegal that is trying to do this. But startups can&#x27;t fix main issues with the immigration.",
                    "time": 1481336385,
                    "type": "comment",
                    "id": 13143624,
                    "by": "vs2370"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13142187,
                                    "text": "But then you&#x27;d have to wait four more. And then four more? Four more after that?",
                                    "time": 1481321927,
                                    "type": "comment",
                                    "id": 13142358,
                                    "by": "up_so_floating"
                                },
                                {
                                    "dead": true,
                                    "parent": 13142187,
                                    "text": "HAHAHA",
                                    "time": 1481323084,
                                    "type": "comment",
                                    "id": 13142478,
                                    "by": "throwaway98764"
                                }
                            ],
                            "parent": 13141808,
                            "text": "&gt; I&#x27;d wait at least a year<p>I&#x27;d say closer to four to be safe.",
                            "time": 1481320513,
                            "type": "comment",
                            "id": 13142187,
                            "by": "akhilcacharya"
                        }
                    ],
                    "parent": 13141796,
                    "text": "Unfortunately any assumptions built into an immigration business are likely to be upended soon. I&#x27;d wait at least a year before trying to solve this problem because the regulatory environment could break your resulting startup.",
                    "time": 1481317260,
                    "type": "comment",
                    "id": 13141808,
                    "by": "ForrestN"
                },
                {
                    "kids": [
                        {
                            "parent": 13143141,
                            "text": "Well, the perseverant ones are having their time spent on bureaucracy, and living in a constant state of foreboding, decreasing the economic value they can add to the country :)",
                            "time": 1481335993,
                            "type": "comment",
                            "id": 13143604,
                            "by": "nsm"
                        }
                    ],
                    "parent": 13141796,
                    "text": "But they try to make it hard because they only want the most perseverant&#x2F;rich immigrants to make it into the country.",
                    "time": 1481329752,
                    "type": "comment",
                    "id": 13143141,
                    "by": "odbol_"
                },
                {
                    "parent": 13141796,
                    "text": "Airside solves for part of this.\n<a href=\"http:&#x2F;&#x2F;airsidemobile.com\" rel=\"nofollow\">http:&#x2F;&#x2F;airsidemobile.com</a>",
                    "time": 1481322054,
                    "type": "comment",
                    "id": 13142368,
                    "by": "lancewiggs"
                },
                {
                    "parent": 13141796,
                    "text": "like a TurboTax for all immigration forms?",
                    "time": 1481334269,
                    "type": "comment",
                    "id": 13143514,
                    "by": "thomasloh"
                }
            ],
            "parent": 13139638,
            "text": "Immigration.<p>Every time I change jobs as an H1-B employee, I&#x27;ve to fill in the same ridiculous data with every law firms weird interface. I wish the US Digital Services would focus on streamlining forms and having auto-import from all the data they already have about me (e.g. automatically translate I-94 records to how much time I actually spent in the US, infer my past I-797 records automatically, have a one time education related upload since that obviously never changes). I realize there are certain valid reasons the agencies don&#x27;t share data, but I find that hard to believe in an era of infinite surveillance, they can&#x27;t use the surveilled data to at least make my life easier. I can see how the immigration law industry would never allow this, but I can hope.<p>The green card process is another minefield.<p>Also for Schengen countries, I&#x27;ve to apply for a visa every time I travel, and they make me list every time I visited the Schengen zone in the past 5 years, fill out the same application form across different countries, and get the same paystubs and letters from employers. Even a tool that could just machine read all the documentation a particular country requires for a specific visa, and just goes and pulls everything that can be pulled (bank statements, pay stubs, fill in travel dates based on the flight ticket emails in my inbox, hotel reservations and so on.) Just make it convenient for me to travel :)",
            "time": 1481317154,
            "type": "comment",
            "id": 13141796,
            "by": "nsm"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142105,
                            "text": "Unfortunately not. FARO and other structured light systems don&#x27;t export texture and are generally too precise (micron) in current form. So they take too much post processing by default.",
                            "time": 1481325178,
                            "type": "comment",
                            "id": 13142697,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "This might already exist depending on your exact requirements and it&#x27;s a fairly common technology in the world of metrology. I regularly work with manufacturers to reverse engineer and&#x2F;or measure molds, jigs, and fixtures for which there are no drawings available. A ROMER or FARO arm with a laser scanning head outputting its point cloud to a software like the PolyWorks suite can generate an incredibly accurate CAD model of incredibly large parts in a very short amount of time (an hour or two at worst if the mesh needs a lot of cleanup).<p>I assume that process would be easy to speed up if the requirement for absolute accuracy was removed. The 8&#x27; ROMER arm we use is accurate to ~!2 microns over its entire volume which is absolutely overkill for something intended to produce models for visual arts applications. A quick and dirty approach to generating the mesh might increase the inaccuracy by several orders of magnitude but when coke can has dimensional tolerances to the tune of tenths of a millimeter, the quick and dirty mesh will still be representative of the end product.",
                    "time": 1481319861,
                    "type": "comment",
                    "id": 13142105,
                    "by": "cc439"
                },
                {
                    "kids": [
                        {
                            "parent": 13141668,
                            "text": "Not really. I know some folks on the RS team and they don&#x27;t really develop around applications, they are more focused on miniaturizing and making RS more available and lower power.<p>That said, some people have tried to use RS for this problem, but from what I&#x27;ve seen end up just using Kinects.",
                            "time": 1481317270,
                            "type": "comment",
                            "id": 13141809,
                            "by": "AndrewKemendo"
                        },
                        {
                            "parent": 13141668,
                            "text": "Mapillary has also been moving quickly in this space, not for objects per se, but entire environments.<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;mapillary&#x2F;OpenSfM\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mapillary&#x2F;OpenSfM</a>",
                            "time": 1481316811,
                            "type": "comment",
                            "id": 13141746,
                            "by": "toomuchtodo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "I think Intel has been trying to do this for a while with their realsense technology and accompanying cameras.<p><a href=\"http:&#x2F;&#x2F;www.intel.in&#x2F;content&#x2F;www&#x2F;in&#x2F;en&#x2F;architecture-and-technology&#x2F;realsense-overview.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.intel.in&#x2F;content&#x2F;www&#x2F;in&#x2F;en&#x2F;architecture-and-techn...</a>",
                    "time": 1481316208,
                    "type": "comment",
                    "id": 13141668,
                    "by": "itsyogesh"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13141605,
                                    "text": "What are the best approaches you&#x27;ve found? Specifically for generating clean, useful NURBS&#x2F;poly mesh models from lidar or SfM dense point cloud data",
                                    "time": 1481316947,
                                    "type": "comment",
                                    "id": 13141761,
                                    "by": "dharma1"
                                }
                            ],
                            "parent": 13141593,
                            "text": "That&#x27;s a different problem set all together actually.<p>But yea, there are a lot of us working on that.",
                            "time": 1481315651,
                            "type": "comment",
                            "id": 13141605,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "My friend&#x27;s working on this, for generating 3d floor plans from point cloud data. It&#x27;s a pretty complex problem.",
                    "time": 1481315578,
                    "type": "comment",
                    "id": 13141593,
                    "by": "dharma1"
                },
                {
                    "parent": 13141243,
                    "text": "There isn&#x27;t a combination of laser scanning and&#x2F;or structured light projection scanning that can accomplish this?  Or is it a speed&#x2F;quality control issue of the output?",
                    "time": 1481331200,
                    "type": "comment",
                    "id": 13143269,
                    "by": "JoblessWonder"
                },
                {
                    "kids": [
                        {
                            "parent": 13142497,
                            "text": "Well it would siphon everything away from the existing 3D capture industry and open it up to smaller groups and those that aren&#x27;t savvy on it yet. The consumer space generally isn&#x27;t doing this so anyone that sells anything would get on board at a low enough price point and simplicity.",
                            "time": 1481325371,
                            "type": "comment",
                            "id": 13142718,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "<i>There&#x27;s $BNs waiting for you.</i><p>Who would be the primary customers? The entire 3D capturing market is currently several $B per year, including services. Where would be the customers that aren&#x27;t getting served today that would double this market?",
                    "time": 1481323245,
                    "type": "comment",
                    "id": 13142497,
                    "by": "rsp1984"
                },
                {
                    "parent": 13141243,
                    "text": "My colleagues at Creaform have something that works pretty well.  Their latest handheld scanner can generate a wire mesh on the fly with 0.030mm resolution.<p><a href=\"http:&#x2F;&#x2F;www.creaform3d.com&#x2F;en\" rel=\"nofollow\">http:&#x2F;&#x2F;www.creaform3d.com&#x2F;en</a><p>10K scans&#x2F;day is way beyond their limits, and I&#x27;m not sure that&#x27;s a very common use case.  But I bet they could get there if they wanted.",
                    "time": 1481324909,
                    "type": "comment",
                    "id": 13142668,
                    "by": "koz1000"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "kids": [
                                                {
                                                    "parent": 13141694,
                                                    "text": "Well yeah the human element is exactly what I&#x27;d want to eliminate as much as possible; I&#x27;m thinking of it more along the lines of what I&#x27;ve seen on How It&#x27;s Made: Dream Cars in the sense that to get the various layers you&#x27;re going to want - basic dimensions, surface features, coloration, reflective properties - aren&#x27;t going to happen in one quick grab I don&#x27;t think, and I get the feeling the process would work best in &quot;absolute darkness&quot; and isolated as much as possible for vibration.<p>Taking that 10k number - assuming disparate types of items that might be part of a series like &quot;Bathroom&quot; (toothbrush, hair brush, toilet brush, plunger) - in 24 hours that means cycling each item through in about 8 seconds. The only way I remotely see that possible is essentially having a robot hand pick up the item at the entry point, hold it for the capture sequence (perhaps have a custom-designed &#x27;mount&#x27; that can allow for true 360 via a couple positions), and then drop it out the other side.<p>It&#x27;s the scale part I&#x27;m wondering about, re: one size machine fits all doesn&#x27;t seem to make sense. One machine for items under a certain dimension (e.g. &quot;hand held&quot;) then another for items where the machine has to essentially have super-powers to pick up and rotate objects to complete the imaging process (e.g. a couch, a dresser, a motorcycle, etc). I think trying too hard to accommodate outliers ends up tainting the balance of operations a little? Just thinking out loud, really cool puzzle.",
                                                    "time": 1481317410,
                                                    "type": "comment",
                                                    "id": 13141831,
                                                    "by": "6stringmerc"
                                                }
                                            ],
                                            "parent": 13141638,
                                            "text": "<i>Oh, so you mean like a big box that could fit XYZ items inside it and capture something like 10,000 per day?</i><p>Maybe but I actually think that&#x27;s the wrong approach.<p><i>I mean, to me it&#x27;s kind of hard to believe nobody&#x27;s tried making a &quot;conveyor belt&quot; like process inside a closed system</i><p>Yea they have - kinda. None of it works well or fast enough though. We put up a patent for one a year ago before I thought there was a better way to do it. The manpower required to move items onto&#x2F;off of a line is a big part of the problem.",
                                            "time": 1481316406,
                                            "type": "comment",
                                            "id": 13141694,
                                            "by": "AndrewKemendo"
                                        }
                                    ],
                                    "parent": 13141592,
                                    "text": "Oh, so you mean like a big box that could fit XYZ items inside it and capture something like 10,000 per day? I mean, to me it&#x27;s kind of hard to believe nobody&#x27;s tried making a &quot;conveyor belt&quot; like process inside a closed system (a shipping container?) with the right optics and resolution to pull it off. Fidelity plus speed plus software consistency. Considering what I saw the gaming industry doing with static models about 10 years ago I kind of thought it&#x27;d be a lot further along now, but I guess not. Sounds like a good project for a few Rensselaer Polytechnic Institute grads that otherwise would&#x27;ve been destined for Kodak.<p>I was musing another kind of &#x27;real world capture&#x27; with videogames, because I want to race around my neighborhood in Forza. <a href=\"https:&#x2F;&#x2F;hackernoon.com&#x2F;dashcam-google-maps-dev-kit-custom-neighborhood-race-tracks-e0094f0749cb#.idu5isvk5\" rel=\"nofollow\">https:&#x2F;&#x2F;hackernoon.com&#x2F;dashcam-google-maps-dev-kit-custom-ne...</a>",
                                    "time": 1481315930,
                                    "type": "comment",
                                    "id": 13141638,
                                    "by": "6stringmerc"
                                }
                            ],
                            "parent": 13141545,
                            "text": "Perhaps I should have specified that I am talking about Computer Generated 3D models, not physical models.",
                            "time": 1481315578,
                            "type": "comment",
                            "id": 13141592,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "What kind of structural integrity do you have in mind? Something with the density of industrial packing foam? I&#x27;ve seen set pieces constructed &#x2F; carved from such material and it can be painted quite well. Putting aside the environmental &#x2F; toxicity concerns for a moment regarding the type of material to be used, I&#x27;m genuinely curious how &quot;rigid&quot; such pieces might need to be.",
                    "time": 1481315231,
                    "type": "comment",
                    "id": 13141545,
                    "by": "6stringmerc"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13141479,
                                    "text": "Would it be useful to capture the full appearance properties of the model (BRDF) etc to be able to accurately render the object?",
                                    "time": 1481316710,
                                    "type": "comment",
                                    "id": 13141732,
                                    "by": "javiramos"
                                }
                            ],
                            "parent": 13141300,
                            "text": "Product development engineer here. In the early stages of a project it can be useful to have CAD models of a competitor&#x27;s product when analyzing how to improve upon them. Recently we had an intern reverse engineer a competitor&#x27;s product, and we&#x27;ve used some of these CAD models as the basis for our new designs.",
                            "time": 1481314675,
                            "type": "comment",
                            "id": 13141479,
                            "by": "my_username_is_"
                        },
                        {
                            "parent": 13141300,
                            "text": "There are multiple but mine specifically is AR. It&#x27;s valuable also for VR, 3D space planning for Designers&#x2F;Architects&#x2F;Engineers, Assets for Game Dev, Objects for modeling and simulation, Training Deep Vision nets and on and on...",
                            "time": 1481313559,
                            "type": "comment",
                            "id": 13141348,
                            "by": "AndrewKemendo"
                        },
                        {
                            "parent": 13141300,
                            "text": "Anyone who does work with 3d content: visual effects, video games, vr, ar, etc. Being able to quickly build your scenes from a huge library or accurate models would be amazing and would save businesses lots of money.",
                            "time": 1481313502,
                            "type": "comment",
                            "id": 13141343,
                            "by": "devopsproject"
                        },
                        {
                            "parent": 13141300,
                            "text": "This combined with 3D printers would make fixing stuff much easier by printing the broken piece.",
                            "time": 1481313817,
                            "type": "comment",
                            "id": 13141378,
                            "by": "polmuz"
                        }
                    ],
                    "parent": 13141243,
                    "text": "What is the use case for the models themselves?",
                    "time": 1481313173,
                    "type": "comment",
                    "id": 13141300,
                    "by": "reneherse"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13141633,
                                    "text": "theres a method for generating 3d point clouds from images using SIFT already",
                                    "time": 1481317424,
                                    "type": "comment",
                                    "id": 13141832,
                                    "by": "8note"
                                }
                            ],
                            "parent": 13141496,
                            "text": "You may be interested in the COIL dataset, it contains images of objects from many angles.<p><a href=\"http:&#x2F;&#x2F;www1.cs.columbia.edu&#x2F;CAVE&#x2F;software&#x2F;softlib&#x2F;coil-100.php\" rel=\"nofollow\">http:&#x2F;&#x2F;www1.cs.columbia.edu&#x2F;CAVE&#x2F;software&#x2F;softlib&#x2F;coil-100.p...</a>",
                            "time": 1481315904,
                            "type": "comment",
                            "id": 13141633,
                            "by": "howderek"
                        },
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13141662,
                                            "text": "That&#x27;s the exact approach that I think is going to work.<p>Well, not exact cause I don&#x27;t like their voxel building generation method.<p>I think a GAN + Procedural Generator is the winner.<p>edit: Let me know if you want to work on this cause it&#x27;s an active area of research for us. See my HN profile for contact.",
                                            "time": 1481316531,
                                            "type": "comment",
                                            "id": 13141709,
                                            "by": "AndrewKemendo"
                                        },
                                        {
                                            "parent": 13141662,
                                            "text": "I think generative models could work but both 2d GAN and 3D voxel GAN are very low res",
                                            "time": 1481317240,
                                            "type": "comment",
                                            "id": 13141806,
                                            "by": "dharma1"
                                        }
                                    ],
                                    "parent": 13141543,
                                    "text": "That makes sense.  I think there&#x27;s opportunity for generative ML to eventually help here.  An open dataset of (images, description) -&gt; 3d model would go a long way.  Check out this paper on using GANs to generate voxel-based models: <a href=\"http:&#x2F;&#x2F;3dgan.csail.mit.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;3dgan.csail.mit.edu&#x2F;</a><p>I&#x27;ve been studying and working with GANs for about a year now.  They are still very exciting, and I&#x27;d love to try to expand my codebase to new types of data.<p>Additionally, there are some recent techniques that haven&#x27;t been tried with voxel-based renderings.<p>Perhaps there is another algorithm that can help go from voxel -&gt; polygons as well.<p>I think with the right tech, time, and execution this could be a matter of:<p>1. Take a picture<p>2. Generate until you get the 3d model you want",
                                    "time": 1481316173,
                                    "type": "comment",
                                    "id": 13141662,
                                    "by": "whataretensors"
                                },
                                {
                                    "dead": true,
                                    "parent": 13141543,
                                    "type": "comment",
                                    "time": 1481316175,
                                    "deleted": true,
                                    "id": 13141663
                                }
                            ],
                            "parent": 13141496,
                            "text": "See other responses for the markets it would serve. Use 3D  modeling by hand pricing as a comp (Low end $10&#x2F;model, average in the $50-100&#x2F;model range, sky&#x27;s the limit for super HQ stuff).<p>Not sure what kind of datasets you&#x27;re looking for. You&#x27;ll see actual products to test with.",
                            "time": 1481315217,
                            "type": "comment",
                            "id": 13141543,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "Where exactly are the $BNs in this tech?  Also, any datasets?  I&#x27;d love to experiment.",
                    "time": 1481314857,
                    "type": "comment",
                    "id": 13141496,
                    "by": "whataretensors"
                },
                {
                    "parent": 13141243,
                    "text": "Yeah think about it as icons but for 3d models.<p>That&#x27;s been turned into an industry with very high throughput.",
                    "time": 1481325094,
                    "type": "comment",
                    "id": 13142688,
                    "by": "ThomPete"
                },
                {
                    "kids": [
                        {
                            "parent": 13141743,
                            "text": "Definitely, though UV mapping from that data takes it to another level of difficulty.",
                            "time": 1481317084,
                            "type": "comment",
                            "id": 13141784,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "Beyond just the 3D: Do you think that capturing the full appearance properties (BRDF etc.) of the object would be useful? This would allow users to very accurately render objects.",
                    "time": 1481316791,
                    "type": "comment",
                    "id": 13141743,
                    "by": "javiramos"
                },
                {
                    "kids": [
                        {
                            "parent": 13141491,
                            "text": "Yes there have been a million attempts since the early days of 3D. Most of them are photogrammetry or structured light setups of some kind, that aren&#x27;t fast enough and don&#x27;t scale for sizing. Part of it is logistics of getting objects through a scanner, with the accuracy being poor or muddy at best.<p>IMO it should be done with a mixture image segmentation and procedural generation.",
                            "time": 1481315054,
                            "type": "comment",
                            "id": 13141516,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "Do you know what has been tried before or references to other attempts?",
                    "time": 1481314781,
                    "type": "comment",
                    "id": 13141491,
                    "by": "zitterbewegung"
                },
                {
                    "kids": [
                        {
                            "parent": 13141394,
                            "text": "<i>You mean better than those inferred from parallax&#x2F;pictures?</i><p>I&#x27;m not sure what you&#x27;re asking here. Are you asking if it should be better than what can be done with photogrammetry?<p><i>And inside the object as well?</i><p>Doing just the outside is a big enough market&#x2F;problem.",
                            "time": 1481314192,
                            "type": "comment",
                            "id": 13141426,
                            "by": "AndrewKemendo"
                        }
                    ],
                    "parent": 13141243,
                    "text": "You mean better than those inferred from parallax&#x2F;pictures?<p>And inside the object as well?",
                    "time": 1481313921,
                    "type": "comment",
                    "id": 13141394,
                    "by": "Chris2048"
                }
            ],
            "parent": 13139638,
            "text": "Rapid generation of high quality 3D models of existing objects. Process should be independent of object size eg. a coke can should use the same process as a car and process time should scale with object size.<p>Think somewhere on the order of 10,000 models per day throughput.<p>There&#x27;s $BNs waiting for you. It&#x27;s ridiculously hard.",
            "time": 1481312726,
            "type": "comment",
            "id": 13141243,
            "by": "AndrewKemendo"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13140569,
                                            "text": "Totally didn&#x27;t think of that, especially the OCR which is great, having used it before with the mobile app.<p>I wonder if you could stitch together a workflow as a reseller for Google Apps (no clue what their current name is)?<p>Either way, good suggestion.",
                                            "time": 1481310064,
                                            "type": "comment",
                                            "id": 13140917,
                                            "by": "dvdhnt"
                                        }
                                    ],
                                    "parent": 13140351,
                                    "text": "Hmm, Google Drive does a reasonable job of that. It indexes everything (including OCR for images + PDFs), has decent search, and has per-folder permissioning and sharing.<p>It&#x27;s actually a pretty good solution for ad-hoc &quot;working together&quot; with someone (a lawyer &#x2F; architect &#x2F; whatever) on a project, where you have lots of files you need to share and refer to during the project.",
                                    "time": 1481307526,
                                    "type": "comment",
                                    "id": 13140569,
                                    "by": "tacostakohashi"
                                }
                            ],
                            "parent": 13140223,
                            "text": "I&#x27;m probably bias because I&#x27;ve lived in two areas now where healthcare is one of a few, if not the, major industry in the area. They&#x27;re always trying out new apps and services here.<p>I am on board with what you&#x27;re saying; an escape hatch for non- or semi-adopters. Obviously, printing is a way to go, so maybe on the mobile app, the ability to check each piece of information required then export&#x2F;email to your preferred destination.<p>It&#x27;d also be interesting to look to make money on conversion i&#x2F;e replacing, or integrating with, the outdated monsters you&#x27;re talking about.<p>Maybe we&#x27;re not even talking about healthcare anymore, maybe just the ability to piece together PII (personally identifiable information) and deliver it to X.<p>&gt;&gt;&gt;&gt; on another note<p>This goes into a topic I&#x27;ve seen posts on recently, and something of interest to me, personal indexing; a better way to throw blobs against the wall and have it indexed for me, leading to a personal Google. I mean, that&#x27;s already coming, really, between Facebook and Google (especially Google Photos) but currently I see nothing about piecing together information I&#x27;d like to share on a professional level.",
                            "time": 1481306095,
                            "type": "comment",
                            "id": 13140351,
                            "by": "dvdhnt"
                        },
                        {
                            "parent": 13140223,
                            "text": "Maybe the problem is we&#x27;re trying to get the wrong people to pay. Since the pain point is with patients, fix it for them and make them pay. Gets around the industry inertia.<p>Sell the service to the patients for some smallish fee ($5 per month) and then provide the integrations into the various provider systems for free.<p>Later on you could scale it up to be an add-on to employee benefits or the health plans.",
                            "time": 1481324592,
                            "type": "comment",
                            "id": 13142646,
                            "by": "ecopoesis"
                        }
                    ],
                    "parent": 13139926,
                    "text": "Too much inertia on the provider side for this to catch on and reach critical mass - many septuagenarian sole practitioners out there using paper diaries &#x2F; files, and larger organisations with some monstrosity written in COBOL (or MUMPS?) that will never change to accommodate this.<p>I&#x27;d suggest something much more low-tech - a website where you can punch in all your details - insurance, allergies, medical history, etc, etc... and then you can print it out (or a subset of it, for different kinds of providers) or generate a PDF that they can copy &amp; paste into their horrible legacy system (an improvement on retyping), or, for those truly at the cutting edge - the kind of electronic transmission you speak of.",
                    "time": 1481305336,
                    "type": "comment",
                    "id": 13140223,
                    "by": "tacostakohashi"
                },
                {
                    "parent": 13139926,
                    "text": "Insurance card scanning and recognition is available. Costs $999.[1] This has apparently been around for years; there&#x27;s Windows 98 support. It&#x27;s been acquired by AcuFill [2]<p>They also offer identity document verification with facial recognition crosscheck. They want to use this to detect visa overstayers for immediate deportation.[3]  That now looks like a market with potential.<p>[1] <a href=\"http:&#x2F;&#x2F;www.card-reader.com&#x2F;medical_cards.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.card-reader.com&#x2F;medical_cards.htm</a>  \n[2] <a href=\"http:&#x2F;&#x2F;www.acuantcorp.com&#x2F;autofill-software&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.acuantcorp.com&#x2F;autofill-software&#x2F;</a>\n[3] <a href=\"http:&#x2F;&#x2F;sandhill.com&#x2F;article&#x2F;its-high-time-we-build-border-technology-not-walls&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;sandhill.com&#x2F;article&#x2F;its-high-time-we-build-border-te...</a>",
                    "time": 1481313701,
                    "type": "comment",
                    "id": 13141368,
                    "by": "Animats"
                },
                {
                    "kids": [
                        {
                            "parent": 13140082,
                            "text": "&gt; The military is terrible for this.<p>Agreed. Especially considering they have an ENTIRE department devoted to personnel along with an office at every single unit level above platoon.",
                            "time": 1481305663,
                            "type": "comment",
                            "id": 13140281,
                            "by": "dvdhnt"
                        },
                        {
                            "kids": [
                                {
                                    "parent": 13140232,
                                    "text": "It&#x27;s mostly paper.",
                                    "time": 1481309319,
                                    "type": "comment",
                                    "id": 13140824,
                                    "by": "mason240"
                                }
                            ],
                            "parent": 13140082,
                            "text": "It might not work for the military specifically, but for browser based forms, Lastpass has a form fill feature:\n<a href=\"https:&#x2F;&#x2F;helpdesk.lastpass.com&#x2F;fill-form-basics&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;helpdesk.lastpass.com&#x2F;fill-form-basics&#x2F;</a><p>I&#x27;m sure it&#x27;s possible to hack together an AHK script[1], combined with Pulover&#x27;s macro creator[2] to automate virtually anything repetitive on a Windows PC, or use Selenium to automate browser actions[3]. Of course then you run the risk of having to fall into the classic XKCD automation time sink[4].<p>[1] <a href=\"http:&#x2F;&#x2F;ahkscript.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ahkscript.org&#x2F;</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.macrocreator.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.macrocreator.com&#x2F;</a><p>[3] <a href=\"http:&#x2F;&#x2F;www.seleniumhq.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.seleniumhq.org&#x2F;</a><p>[4] <a href=\"https:&#x2F;&#x2F;xkcd.com&#x2F;1319&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;xkcd.com&#x2F;1319&#x2F;</a>",
                            "time": 1481305388,
                            "type": "comment",
                            "id": 13140232,
                            "by": "patrickk"
                        }
                    ],
                    "parent": 13139926,
                    "text": "The military is terrible for this. You are constantly filling out forms that amount to a half page of your basic information, followed by a couple of text fields that form is actually for.",
                    "time": 1481304345,
                    "type": "comment",
                    "id": 13140082,
                    "by": "mason240"
                },
                {
                    "parent": 13139926,
                    "text": "France has national healthcare and everyone has a smart card with vital information, and all doctors have the hardware to read it and software to process it. Or at least they did 15 years ago when I was there.<p>Edit to add: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Carte_Vitale\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Carte_Vitale</a>",
                    "time": 1481318024,
                    "type": "comment",
                    "id": 13141905,
                    "by": "205guy"
                },
                {
                    "parent": 13139926,
                    "text": "We just built something like this for the health market. Users can auto-sigin to websites with one of their identities or set it to ask for each visit. Here is a lil demo I made that uses Craiglist as an example: <a href=\"http:&#x2F;&#x2F;tricorder.org&#x2F;cl\" rel=\"nofollow\">http:&#x2F;&#x2F;tricorder.org&#x2F;cl</a> \nWhen the user goes to your website, say wellness.com&#x2F;newcustomer, there are javascript APIs to get at your standard data, that brings up a perm dialog and if the user accepts, the data is sent to the website. Send me an email (profile) if you want to talk biz, tho was planning to open source it. Auth is very solid, but its currently android only.",
                    "time": 1481315583,
                    "type": "comment",
                    "id": 13141595,
                    "by": "grizzles"
                },
                {
                    "parent": 13139926,
                    "text": "I am working on a patient-driven platform which brings together all key stakeholders with support of a few good partners, and I am currently conducting user interviews for it. I would love to talk with you more about your ideas. To make scheduling painless, I have a link in my LinkedIn profile summary:<p><a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;rancar2\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;rancar2</a><p>I would love to hear from anyone else with big ideas relating to or are working on driving outcomes towards holistic wellness with patient-center healthcare, patient data collection&#x2F;quantified self, and patient-powered research networks. In the bigger picture, I am passionate about making the world a better place through innovation and working on what really matters for humanity.",
                    "time": 1481307794,
                    "type": "comment",
                    "id": 13140597,
                    "by": "rancar2"
                },
                {
                    "parent": 13139926,
                    "text": "I&#x27;m surprised none of the comments mentioned ZocDoc, which does most of this already. You can fill out forms once, schedule appointments and click to send your info to the office.",
                    "time": 1481324559,
                    "type": "comment",
                    "id": 13142644,
                    "by": "KingMob"
                },
                {
                    "parent": 13139926,
                    "text": "we&#x27;re making something similar, currently sitting at ~40k patient users, 200+ health systems adopted -<p><a href=\"https:&#x2F;&#x2F;crosschx.com&#x2F;patients\" rel=\"nofollow\">https:&#x2F;&#x2F;crosschx.com&#x2F;patients</a>",
                    "time": 1481313701,
                    "type": "comment",
                    "id": 13141367,
                    "by": "dzjin"
                },
                {
                    "kids": [
                        {
                            "parent": 13141968,
                            "text": "It is but you need to understand why that happens (hint: $$)<p>When you go to the doctor for a sinus infection, the cost of this is not fixed, even across insurance companies. The other factor is the &quot;level&quot; of service. (ref: <a href=\"http:&#x2F;&#x2F;medicaleconomics.modernmedicine.com&#x2F;medical-economics&#x2F;RC&#x2F;evaluation-and-management-bill-correct-level-care\" rel=\"nofollow\">http:&#x2F;&#x2F;medicaleconomics.modernmedicine.com&#x2F;medical-economics...</a>)<p>The more in-depth the examination and the more time you spend with the patient, the more they can charge. All those forms are &quot;taking family history&quot;, etc. and it is free money since you have to do the work. Those are then scanned so they can be used later in an audit.<p>(Source: I also worked at a start-up that was trying to disrupt out patient medical systems. It&#x27;s very hard and has lots of roadblocks. btw, of the top 50 EMRs in the US, only 3 have APIs and these are mostly to pull data, not push it back in).",
                            "time": 1481319356,
                            "type": "comment",
                            "id": 13142052,
                            "by": "snarf21"
                        }
                    ],
                    "parent": 13139926,
                    "text": "agreed providing the same exact 4 pages of info to every doctor&#x27;s office is insane.",
                    "time": 1481318551,
                    "type": "comment",
                    "id": 13141968,
                    "by": "EricDeb"
                },
                {
                    "dead": true,
                    "parent": 13139926,
                    "text": "France has national healthcare and everyone has a smart card with vital information, and all doctors have the hardware to read it and software to process it. Or at least they did 15 years ago when I was there.",
                    "time": 1481318026,
                    "type": "comment",
                    "id": 13141906,
                    "by": "205guy"
                }
            ],
            "parent": 13139638,
            "text": "Semi-related... I work in wellness and healthcare.<p>I don&#x27;t know about you, but I despise filling out the same forms over and over again when seeing new healthcare providers. I&#x27;d love to start a service modeled after granular smartphone permissions where<p>(a) I check in at a new office (scan a code, they scan my code, beacon, something like that)<p>(b) the office then requests x, y, and z information<p>(c) a push is sent to my phone where I can review the information and approve or disapprove some or all permissions<p>(d) a final step of either entering my pin at the office, using my thumbprint on my device, or something else.<p>The key components would be storing the data encrypted at rest, following HIPAA and then some, having a solid auth protocol (keys, jwts, etc).<p>I think adoption would be helped because the public are already used to permissions like these when installing apps.<p>The benefits are a lack of paper trail, no one is going to not shred my SSN, my most up to date data is now available, and instead of hosting N apps&#x2F;databases, I&#x27;m storing 1 and can reduce my maintenance, customer support issues because one for all, all for one.<p>Edit: edited for readability.",
            "time": 1481303055,
            "type": "comment",
            "id": 13139926,
            "by": "dvdhnt"
        },
        {
            "parent": 13139638,
            "text": "The oil and gas industry is ripe with potential start ups. Here are a few that come to mind:<p>1.  A better system for automation and measurement.  Current solutions aren&#x27;t ideal when it comes to setting up new systems as well as updating and maintaining existing systems.  We build several million dollar facilities a month and each one has automation and measurement equipment that has to be individually set up and programmed.  Each technician does things a slightly different way, and the end result is a different set of automation and measurement logic at each facility.<p>2) Fiber optic DATS (distributed acoustic and temperature sensing) data handling and interpretation.  This is a fairly new type of technology in which a fiber optic line is installed in the wellbore.  The fiber optic line basically acts as a 15,000&#x27; strand of thermometers and microphones placed every 3&#x27;. The data from one installation is on the order of terabytes per hour.  Oil and gas service companies that offer this service don&#x27;t know how to handle this amount of data.  The problem could probably be solved with S3 or something.<p>3) Drilling optimization. Create a software suite that utilizes ML&#x2F;AI to help drilling engineers figure out the best way to drill a well is. It&#x27;s a perfect ML&#x2F;AI application. Lots and lots of training data available,  easily defined input and output parameters, etc. Drilling engineering is full of hard, non-linear problems and humans are just really bad at it. The only way to be good at it is to drill lots and lots of wells and then listen to your gut.",
            "time": 1481335297,
            "type": "comment",
            "id": 13143561,
            "by": "athollywood"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13140506,
                                            "text": "I&#x27;m well aware :) I wrote UnityPack: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;HearthSim&#x2F;UnityPack\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;HearthSim&#x2F;UnityPack</a>",
                                            "time": 1481307922,
                                            "type": "comment",
                                            "id": 13140625,
                                            "by": "scrollaway"
                                        }
                                    ],
                                    "parent": 13140416,
                                    "text": "BTW Unity, with all its excellence, has really horrible data format for content and patch distribution, and had and still has huge problems with this. Perhaps the legacy of early overengineering and struggle to protect the games from easy reverse-engineering.<p>And compare, say, to simple incremental zips of Quake with alphabetic file loading order.. Total no-brainer to implement and use. (I have even seen zips with custom LZMA compression!)<p>So, if any, someone will have to solve a problem of artificially created obstacles, not a problem per se.",
                                    "time": 1481307177,
                                    "type": "comment",
                                    "id": 13140506,
                                    "by": "juskrey"
                                },
                                {
                                    "parent": 13140416,
                                    "text": "The path forward for games is roughly similar to where digital audio is now: Comprehensive workstation environments with an easing facade through plugins, presets, etc. The coarse elements of a rendering algorithm or a piece of game logic can be reduced to a processing graph, behavior tree, or other convenient abstractions. They can plug into each other by exposing both assets and processing as globally addressable data. Original coding for game logic will still be required for the foreseeable future, but most of the development problem is weighted towards getting assets in the game, and that can be abstracted.<p>This is done in bits and pieces across existing engines and third-party tools, but there&#x27;s a lot of room to make it cheaper and easier.",
                                    "time": 1481319623,
                                    "type": "comment",
                                    "id": 13142084,
                                    "by": "buzzybee"
                                },
                                {
                                    "kids": [
                                        {
                                            "parent": 13140593,
                                            "text": "I used to use irrlicht and Ogre. Both have the problem of only really doing graphics and to a certain extent input. In comparison, Unity and Unreal offer the whole package: graphics, asset pipeline, audio, networking, and physics.<p>Speaking from experience as I&#x27;m currently making the jump to Unity for my projects, the time savings of choosing one of the all-in-one engines instead of gluing together engines is really substantial.",
                                            "time": 1481319985,
                                            "type": "comment",
                                            "id": 13142126,
                                            "by": "munchbunny"
                                        }
                                    ],
                                    "parent": 13140416,
                                    "text": "Unreal engine is quit good.<p>But I&#x27;m a huge fan of irrlicht 3d.no idea why no one uses it?<p>You could then devote so much more time on ideas...",
                                    "time": 1481307749,
                                    "type": "comment",
                                    "id": 13140593,
                                    "by": "Bombthecat"
                                }
                            ],
                            "parent": 13140332,
                            "text": "I think the &quot;900 different data formats&quot; problem is something that will go away as we move towards better tools which cover all the standard use cases.<p>Gamedev is riddled with really smart people that reinvent the wheel <i>all the time</i> because they found a way to micro-optimize this or that. They get to do this because until recently, there was no &quot;good enough&quot; solution for a wide range of games (or the &quot;solution&quot; was priced with enough zeroes to make bill gates cringe).<p>But you saw how popular Unity got, and how fast. That&#x27;s the games industry in a nutshell: ripe for solutions that work for more than just one studio.",
                            "time": 1481306557,
                            "type": "comment",
                            "id": 13140416,
                            "by": "scrollaway"
                        }
                    ],
                    "parent": 13140257,
                    "text": "I have devoted 10 years to game content distribution, packing, compression etc. (Now not in gamedev anymore)\nThis is a very easy problem which usually solved by attaching fairly simple script which is aware of your file formats to any commercial installer system.<p>Some companies are even selling more or less standard solutions for that, but in reality from any given 1000 games 900 will have very different data formats and all have fairly good reasons to do so - using universal &quot;patch systems&quot; really creates more problems.",
                    "time": 1481305996,
                    "type": "comment",
                    "id": 13140332,
                    "by": "juskrey"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13141678,
                                            "text": "That&#x27;s quite incredibly thorough. How familiar are you with Blizzard&#x27;s NGDP protocol &#x2F; CASC file format?",
                                            "time": 1481329236,
                                            "type": "comment",
                                            "id": 13143087,
                                            "by": "scrollaway"
                                        }
                                    ],
                                    "parent": 13141399,
                                    "text": "Hey, amos here, main developer of wharf&#x2F;butler, here&#x27;s a quick technical summary so you don&#x27;t have to do the digging yourself:<p>- File formats are streams of protobuf messages - efficient serialization, easy to parse from a bunch of programming languages. Most files (patches, signatures) are composed of an uncompressed header, and a brotli-compressed stream (in the reference implementation, compression format are pluggable) of other messages.<p>- The main diff method is based on rsync. It&#x27;s slightly tuned, in that: it operates over the hashes of all files (which means rename tracking is seamless - the reference implementation detects that and handles it efficiently), and it takes into account partial blocks (at the end of files, smaller than the block size)<p>- The reference implementation is quite modular Go, which is nice for portability, and, like elisee mentioned, used in production at itch.io. We assume most things are streaming (so that, for example, you can apply a patch while downloading it, no temporary writes to disk needed), we actually use a virtual file system for all downloads and updates.<p>- The reference implementation contains support for block-based (4MB default) file delivery, which is useful for a verify&#x2F;heal process (figure out which parts are missing&#x2F;have been corrupted and correct them)<p>- The wharf repo contains the basis of a second diff method, based on rsync - for a secondary patch optimization step. The bsdiff algorithm is well-commented with references to the original paper, and there&#x27;s an opt-in parallel bsdiff codepath (as in multi-core suffix sorting, not just bsdiff operating on chunks)<p>- A few other companies (including well-known gaming actors) have started reaching out &#x2F; using parts of wharf for their own usage, I&#x27;ll happily name names as soon as it&#x27;s all become more public :)<p>I&#x27;d be happy to answer any questions!",
                                    "time": 1481316281,
                                    "type": "comment",
                                    "id": 13141678,
                                    "by": "fasterthanlime"
                                }
                            ],
                            "parent": 13141268,
                            "text": "Wow, that&#x27;s really impressive. I&#x27;ll investigate, thank you for the link.",
                            "time": 1481313970,
                            "type": "comment",
                            "id": 13141399,
                            "by": "scrollaway"
                        }
                    ],
                    "parent": 13140257,
                    "text": "itch.io&#x27;s new open source wharf &amp; butler tools might be what you&#x27;re looking for: <a href=\"https:&#x2F;&#x2F;itch.io&#x2F;docs&#x2F;wharf&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;itch.io&#x2F;docs&#x2F;wharf&#x2F;</a> and <a href=\"https:&#x2F;&#x2F;itch.io&#x2F;docs&#x2F;butler&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;itch.io&#x2F;docs&#x2F;butler&#x2F;</a><p>Quoting Wharf&#x27;s spec intro:<p><pre><code>    Wharf is a protocol that enables incremental uploads and downloads to keep software up-to-date. It includes:\n\n    A diffing and patching algorithm, based on rsync\n    An open file format specification for patches and signature files, based on protobuf\n    A reference implementation in Go\n    A command-line tool with several commands\n</code></pre>\nButler is the commandline tool for generating patches (it can negotiate small diffs from the server without requiring a full local copy of the thing you&#x27;re diffing against), uploading them and applying them back on the client.<p>It is used to power itch.io&#x27;s Steam-like application, itch: <a href=\"http:&#x2F;&#x2F;itch.io&#x2F;app\" rel=\"nofollow\">http:&#x2F;&#x2F;itch.io&#x2F;app</a>, delivering multi-gigabyte game installs &amp; updates.",
                    "time": 1481312923,
                    "type": "comment",
                    "id": 13141268,
                    "by": "elisee"
                },
                {
                    "parent": 13140257,
                    "text": "Please, someone tell Apple so I can stop downloading 4GB to update Xcode.",
                    "time": 1481329996,
                    "type": "comment",
                    "id": 13143173,
                    "by": "odbol_"
                },
                {
                    "parent": 13140257,
                    "text": "Have you looked at GoG Galaxy?<p><a href=\"https:&#x2F;&#x2F;www.gog.com&#x2F;galaxy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gog.com&#x2F;galaxy</a><p>It&#x27;s exactly what you want, but this service isn&#x27;t poplar. It doesn&#x27;t work because everyone is on Steam. Network effects. It&#x27;s like when app.net tried to replace twitter. You can get mad at users, but users are using Steam &amp; Origin and Battle.net and they don&#x27;t care.",
                    "time": 1481317278,
                    "type": "comment",
                    "id": 13141811,
                    "by": "mevile"
                },
                {
                    "parent": 13140257,
                    "text": "Google just released File-By-File patching for zip files -- sounds like it might be close:<p><a href=\"http:&#x2F;&#x2F;android-developers.blogspot.com.au&#x2F;2016&#x2F;12&#x2F;saving-data-reducing-the-size-of-app-updates-by-65-percent.html\" rel=\"nofollow\">http:&#x2F;&#x2F;android-developers.blogspot.com.au&#x2F;2016&#x2F;12&#x2F;saving-dat...</a>",
                    "time": 1481316420,
                    "type": "comment",
                    "id": 13141695,
                    "by": "grizzles"
                },
                {
                    "parent": 13140257,
                    "text": "What&#x27;s wrong with Valve&#x27;s?",
                    "time": 1481305754,
                    "type": "comment",
                    "id": 13140293,
                    "by": "chipperyman573"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13141065,
                                            "text": "I&#x27;m not disputing your claim, but EA does have plenty of games on Steam, they just aren&#x27;t publishing any new ones to it.<p><a href=\"http:&#x2F;&#x2F;store.steampowered.com&#x2F;search&#x2F;?publisher=Electronic%20Arts\" rel=\"nofollow\">http:&#x2F;&#x2F;store.steampowered.com&#x2F;search&#x2F;?publisher=Electronic%2...</a>",
                                            "time": 1481319226,
                                            "type": "comment",
                                            "id": 13142038,
                                            "by": "kedean"
                                        }
                                    ],
                                    "parent": 13140371,
                                    "text": "Steam supports any game from any publisher, including self-published games.  Steam is exactly what you get when you try to solve this problem, because none of the big companies want to be involved, since they see it as competition.  Blizzard and EA are the only two big companies I know of that are not on Steam, and they both have direct competitors to it that are vendor-locked.",
                                    "time": 1481311399,
                                    "type": "comment",
                                    "id": 13141065,
                                    "by": "danielvinson"
                                }
                            ],
                            "parent": 13140294,
                            "text": "For themselves! It&#x27;s also not a great system, lots of legacy. More to the point though, it&#x27;s not a commercial system. Steam behaves as a distribution platform and licenses the publishing rather than the distribution.<p>Which is not at all interesting for self-published games (be it indies who want to avoid steam, big publishers with their own systems etc).",
                            "time": 1481306219,
                            "type": "comment",
                            "id": 13140371,
                            "by": "scrollaway"
                        }
                    ],
                    "parent": 13140257,
                    "text": "Didn&#x27;t Steam already solve this?",
                    "time": 1481305755,
                    "type": "comment",
                    "id": 13140294,
                    "by": "mcheshier"
                }
            ],
            "parent": 13139638,
            "text": "Content and patch distribution for video games: Data integrity, progressive downloads, file-level patching, compression, encryption, and platform&#x2F;version branching.<p>It&#x27;s quite mind-boggling; nobody is really doing it on an industry-scale level. Every video game developer has their own way, all of which have their own problems.<p>It is a very hard problem. Blizzard actually came up with a very good system, but it&#x27;s not in a state where it can be commercialized or open sourced.<p>I actually think whoever comes up with a system which solves these problems in a clean and consistent way will be sitting on a little revolution for content distribution.",
            "time": 1481305515,
            "type": "comment",
            "id": 13140257,
            "by": "scrollaway"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141161,
                            "text": "A friend of mine was an environmental consultant, and went to startup weekend. They successfully made a SaaS app that would spit out an environmental report in minutes instead of days of manual entry. Just a really good example of small applications that have a huge benefit in old industries <a href=\"http:&#x2F;&#x2F;www.enterratech.com&#x2F;reports&#x2F;1&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.enterratech.com&#x2F;reports&#x2F;1&#x2F;</a>",
                            "time": 1481320618,
                            "type": "comment",
                            "id": 13142197,
                            "by": "fudged71"
                        },
                        {
                            "kids": [
                                {
                                    "parent": 13141283,
                                    "text": "99% Invisible&#x27;s <i>America&#x27;s Last Top Model</i>. The Mississippi River Basin model was shut down because the computer models were cheaper and &quot;good enough.&quot; They still use physical models today for other projects, albeit on a much smaller scale.<p>Fluid simulation is a very difficult problem to simulate, structures are a lot simpler.<p><a href=\"http:&#x2F;&#x2F;99percentinvisible.org&#x2F;episode&#x2F;americas-last-top-model&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;99percentinvisible.org&#x2F;episode&#x2F;americas-last-top-mode...</a>",
                                    "time": 1481314211,
                                    "type": "comment",
                                    "id": 13141430,
                                    "by": "wlesieutre"
                                }
                            ],
                            "parent": 13141161,
                            "text": "Reminds me of the story that made the podcast rounds not too long ago, about the Mississippi River Basin Model.<p>I thought it was shut down largely because much better software simulations were made available; are they still kinda crummy?",
                            "time": 1481313005,
                            "type": "comment",
                            "id": 13141283,
                            "by": "pavel_lishin"
                        }
                    ],
                    "parent": 13140424,
                    "text": "I suspect much engineering software is ripe for innovation. My wife is a Water Resources Engineer- a specialized form of Civil that focuses on &quot;when it rains, where the hell is all this water going to go?&quot;.<p>The software for that kind of modeling is apparently pretty basic, pretty expensive, buggy, etc.",
                    "time": 1481312129,
                    "type": "comment",
                    "id": 13141161,
                    "by": "mabbo"
                },
                {
                    "parent": 13140424,
                    "text": "Out of curiosity, what do you think of what flux.io is doing? If a SaaS structural engineering application could be integrated with that, would it address your needs?<p>(For what it&#x27;s worth, I&#x27;m doing something similar in the transport planning space. And yes, bridging the gap between that and modern CS is a substantial piece of work.)",
                    "time": 1481330075,
                    "type": "comment",
                    "id": 13143176,
                    "by": "nkoren"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13141574,
                                            "text": "&gt; I was more leaning towards member design software, such as spColumn and S-Concrete.<p>The utility of your software tools will be very limited if you are restricting yourself to only member design instead of total structure solutions like ETABS. Why should engineer pay you at all if they can use spreadsheet for free to do what you do with your SaaS?<p>&gt; No one I know is using the automated concrete design built into analysis programs like ETABS, Tekla, etc.<p>Not too sure about this because I know quite a lot of people who are using these tools. Any reason why the people you know don&#x27;t use ETABS or Tekla?",
                                            "time": 1481336248,
                                            "type": "comment",
                                            "id": 13143618,
                                            "by": "nsoonhui"
                                        }
                                    ],
                                    "parent": 13141262,
                                    "text": "In my original post, I was more leaning towards member design software, such as  spColumn and S-Concrete.<p>These are much more standalone, and don&#x27;t have many of the issues you listed.<p>No one I know is using the automated concrete design built into analysis programs like ETABS, Tekla, etc.",
                                    "time": 1481315444,
                                    "type": "comment",
                                    "id": 13141574,
                                    "by": "ggcdn"
                                }
                            ],
                            "parent": 13140974,
                            "text": "Tekla Structures has dedicated reinforcement concrete design features. The licence cost is probably closer to 10k per seat.<p>You need computational geometry, computer graphics, and structural engineering expert level domain knowledge to implement anything. You need to create traditional 2D machine&#x2F;construction design drawings from the 3D models. Then you need to sell it to corporations, whose work, most of all, must be dependable and free of guess work.<p>You need to know what sort of geometries you can use to model the reinforcements. Then you need to know how to design the system so it can handle very large amounts of geometry.<p>The worst of all is you need to deal with god awful industry standard formats- DWG, DGN, IFC, Step&#x2F;Iges and so on.  Maybe DWG import and export first.<p>To have any real chance you need a guy or two who are good with numerical code, someone who is familiar with e.g. Game engines, soemone who knows computer graphics, a structural engineer to tell how he does his job and what the thousand inconsistencies in the field are (this is not a trivial domain like housing or transport), a sales&#x2F;marketing guy to connect and push the product.<p>And, like someone else estimated, the potential market is not gigantic - which is kinda funny because we all depend on reinforced concrete but don&#x27;t need so many engineers for the design work...",
                            "time": 1481312864,
                            "type": "comment",
                            "id": 13141262,
                            "by": "fsloth"
                        }
                    ],
                    "parent": 13140424,
                    "text": "Have you got an example&#x2F;names of existing software? I&#x27;m interested to see what kind of features they have.",
                    "time": 1481310530,
                    "type": "comment",
                    "id": 13140974,
                    "by": "aith"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13140911,
                                    "text": "So, current market size about 10k * 14,070 = 140M.",
                                    "time": 1481315350,
                                    "type": "comment",
                                    "id": 13141563,
                                    "by": "sharemywin"
                                },
                                {
                                    "parent": 13140911,
                                    "text": "Its at least a structured analysis. Thanks for teaching something today.",
                                    "time": 1481327331,
                                    "type": "comment",
                                    "id": 13142926,
                                    "by": "rgovind"
                                }
                            ],
                            "parent": 13140627,
                            "text": "Not sure.<p>In the US there are about 281,400 civil engineers [1]. I couldn&#x27;t find more detailed information on structural engineers.<p>-Assume about 10% are practicing structural engineers who need to design concrete structures = 28140.<p>-Assume a company wants 1 license for every 2 engineers = 14070. (I base this off the fact that my company has 6 licenses for 12 engineers, but we may be higher than average)<p>-Assume we could get 10% market share = 1407 subscribers.<p>-Assume $1000&#x2F;subscriber&#x2F;year = $1,407,000 from the US market<p>Obviously this isn&#x27;t a very rigourous analysis.<p>[1]: <a href=\"http:&#x2F;&#x2F;www.bls.gov&#x2F;ooh&#x2F;architecture-and-engineering&#x2F;civil-engineers.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bls.gov&#x2F;ooh&#x2F;architecture-and-engineering&#x2F;civil-en...</a>",
                            "time": 1481310022,
                            "type": "comment",
                            "id": 13140911,
                            "by": "ggcdn"
                        }
                    ],
                    "parent": 13140424,
                    "text": "What is the total size of this market - how many users&#x2F;seats are there out there for this?",
                    "time": 1481307935,
                    "type": "comment",
                    "id": 13140627,
                    "by": "tacostakohashi"
                },
                {
                    "kids": [
                        {
                            "parent": 13141405,
                            "text": "Can you post the link to the github repo?",
                            "time": 1481323269,
                            "type": "comment",
                            "id": 13142501,
                            "by": "mnguyenngo"
                        }
                    ],
                    "parent": 13140424,
                    "text": "My brother in law would agree with this, he is building an open source project for collecting all of the analysis that civil and structural engineers have to do on every project into a single repository where people can share and augment the calculations. (think if it as github for civil and structural engineers)",
                    "time": 1481314004,
                    "type": "comment",
                    "id": 13141405,
                    "by": "ChuckMcM"
                },
                {
                    "kids": [
                        {
                            "parent": 13141561,
                            "text": "That&#x27;s disgusting. I feel filthy. I replaced a system in my  first client school that also used excel attachments for tracking student data, exams results, attendance, assignments, etc. I could physically feel better once I saw my own implementation replacing email attachment system. Since then email-excel has been a sensitive topic for me.",
                            "time": 1481319112,
                            "type": "comment",
                            "id": 13142024,
                            "by": "Achshar"
                        },
                        {
                            "kids": [
                                {
                                    "parent": 13142112,
                                    "text": "Isn&#x27;t that essentially Google Sheets + Forms? You create a spreadsheet and then generate a data entry form from it automatically.",
                                    "time": 1481332500,
                                    "type": "comment",
                                    "id": 13143392,
                                    "by": "icebraining"
                                }
                            ],
                            "parent": 13141561,
                            "text": "An app that you can import any spreadsheet into and that generates web&#x2F;mobile apps to collect the same information would be cool.<p>And that pushes the data back into the same spreadsheet and a relational database with change history.",
                            "time": 1481319882,
                            "type": "comment",
                            "id": 13142112,
                            "by": "stretchwithme"
                        },
                        {
                            "parent": 13141561,
                            "text": "Smartsheet is a pretty good direct replacement for emailing excel spreadsheets.<p><a href=\"https:&#x2F;&#x2F;www.smartsheet.com&#x2F;product-tour\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartsheet.com&#x2F;product-tour</a>",
                            "time": 1481320003,
                            "type": "comment",
                            "id": 13142127,
                            "by": "VintageCool"
                        }
                    ],
                    "parent": 13140424,
                    "text": "I have a friend who works in construction glass. (It&#x27;s NYC, that&#x27;s a big market). They ship millions of dollars of complex, custom molded glass every year. Everything&#x27;s kept track of by emailing excel spreadsheets.",
                    "time": 1481315335,
                    "type": "comment",
                    "id": 13141561,
                    "by": "patmcguire"
                },
                {
                    "parent": 13140424,
                    "text": "Is this something you&#x27;re interested in talking more about? My company specializes in comp sci + engineering work. Your email isn&#x27;t listed but mine is in my profile.",
                    "time": 1481319025,
                    "type": "comment",
                    "id": 13142013,
                    "by": "Clanan"
                }
            ],
            "parent": 13139638,
            "text": "As a structural engineer, I see a good opportunity to make reinforced concrete design software available in a SaaS format. The competition is outdated, clunky, requires local installation and messing about with licenses. Design firms are paying $1000-$3000&#x2F;year per user&#x2F;seat for what amounts to a pretty basic app.<p>Unfortunately, there are very few people that understand both computer science and structural engineering.",
            "time": 1481306628,
            "type": "comment",
            "id": 13140424,
            "by": "ggcdn"
        },
        {
            "kids": [
                {
                    "parent": 13142434,
                    "text": "I suggest checking out Updater: <a href=\"http:&#x2F;&#x2F;www.updater.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.updater.com&#x2F;</a>",
                    "time": 1481332323,
                    "type": "comment",
                    "id": 13143373,
                    "by": "tompetry"
                }
            ],
            "parent": 13139638,
            "text": "A one stop service for moving.<p>Connecting&#x2F;disconnecting utilities, address change, car registration, new laws I should be aware of.<p>End the piecemeal.",
            "time": 1481322681,
            "type": "comment",
            "id": 13142434,
            "by": "costcopizza"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141594,
                            "text": "<p><pre><code>    The entire Real-Estate industry is ripe for disruption.\n    Exactly why are we paying 6% to &quot;agents&quot;?\n</code></pre>\n<a href=\"https:&#x2F;&#x2F;www.redfin.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.redfin.com&#x2F;</a> is already doing this.  They charge half the normal fee if you&#x27;re selling and they give about half of their fee to you after purchase if you&#x27;re buying.<p>(We bought our house with them.)",
                            "time": 1481324508,
                            "type": "comment",
                            "id": 13142639,
                            "by": "cbr"
                        },
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13142384,
                                            "text": "True a buyer could be let into a home by sellers agent and even use the sellers agent to purchase the home. Agents love this! Its called getting both ends of the deal. It doubles the agents commission. Does not benefit buyer at though and actually is a bad idea.",
                                            "time": 1481323986,
                                            "type": "comment",
                                            "id": 13142577,
                                            "by": "wehadfun"
                                        }
                                    ],
                                    "parent": 13142142,
                                    "text": "On 2, buyers can be let into the home by the seller&#x27;s agent.",
                                    "time": 1481322153,
                                    "type": "comment",
                                    "id": 13142384,
                                    "by": "bluedevil2k"
                                },
                                {
                                    "kids": [
                                        {
                                            "parent": 13142555,
                                            "text": "Its worth what agents are willing to do it for. If you cant find a real estate agent willing to help you sell your house for 0.5% then it is not worth it.",
                                            "time": 1481324189,
                                            "type": "comment",
                                            "id": 13142601,
                                            "by": "wehadfun"
                                        }
                                    ],
                                    "parent": 13142142,
                                    "text": "If that&#x27;s all most agents are doing, that&#x27;s worth <i>maybe</i> 0.5%.",
                                    "time": 1481323720,
                                    "type": "comment",
                                    "id": 13142555,
                                    "by": "mratzloff"
                                },
                                {
                                    "time": 1481321146,
                                    "id": 13142262,
                                    "parent": 13142142,
                                    "deleted": true,
                                    "type": "comment"
                                }
                            ],
                            "parent": 13141594,
                            "text": "Wife&#x27;s a real estate agent so I have some insight.<p>Agents mainly do two things:<p>1. If selling they can put your house into MLS.<p>2. For buyers they can let you into a house.<p>Being able to do these things requires NAR membership, a state license, and other fees and cost real estate agents thousands per year. Also driving meetings clients at houses takes gas and time. Also your 6% commisiion is paying for all the other people that the agent spent gas and time on who did not buy a house.<p>Would you be willing to advertise in the news paper that your house is for sale and leave the doors unlocked so that random people could check it out?",
                            "time": 1481320166,
                            "type": "comment",
                            "id": 13142142,
                            "by": "wehadfun"
                        },
                        {
                            "parent": 13141594,
                            "text": "The real estate industry is very heavily regulated and, worse, these regulations are extremely fragmented. Any disruption is going to have to deal with that.<p>Also, agents for basic residential purchases where the property is about as mundane as it gets provide very little value. However good agents will do proper diligence by inspecting the public records for the property. That part <i>may</i> be disruptable with software and an ambitious enough records maintenance effort. But good agents who do their jobs properly are well worth 6% (and, by the way, that 6% is frequently split two ways, so each agent gets 3%). Of course my bar for &quot;good agent&quot; is much higher than Joe Coldwell or Jane Keller-Williams. &quot;Good&quot; agents know local and state regulations very well and do diligence to inspect the public record and work closely with well qualified inspectors to get the best (lowest for buyer, highest for seller) price they can. Most agents, especially for &quot;big box&quot; brokers do basic humdrum contract paperwork and have a very basic approach to disclosure and negotiation and don&#x27;t add much value. They&#x27;re ripe for disruption.",
                            "time": 1481317331,
                            "type": "comment",
                            "id": 13141819,
                            "by": "sidlls"
                        },
                        {
                            "parent": 13141594,
                            "text": "Agreed. There are many potential advertising opportunities to boot.<p>When people buy a new home and move they typically need to get new utilities, health and car insurance, doctors, dentists, furniture, appliances, etc... They need to decide where they&#x27;re going to shop for groceries, which restaurants they want to explore, what activities they&#x27;re going to get into.",
                            "time": 1481317471,
                            "type": "comment",
                            "id": 13141839,
                            "by": "wefarrell"
                        },
                        {
                            "parent": 13141594,
                            "text": "Reminds me of the piece that Freakonomics did on real estate agents. It&#x27;s probably worth the read for anyone about to buy&#x2F;sell a home.",
                            "time": 1481323870,
                            "type": "comment",
                            "id": 13142564,
                            "by": "jlgaddis"
                        },
                        {
                            "parent": 13141594,
                            "text": "<i>The entire Real-Estate industry is ripe for disruption. Exactly why are we paying 6% to &quot;agents&quot;? What are &quot;agents&quot; actually doing? ...</i><p>I basically agree, but I will say that when we bought our house and the (FSBO) seller turned out to be a flake and&#x2F;or an outright nutcase, the realtor we were working with earned every penny of his 3%.  I won&#x27;t go into what he did for us because some of it may not necessarily have been legal for someone who&#x27;s not an attorney to perform.  Let&#x27;s just say it took a lot of hustle to hold the seller to his commitments and make the deal happen according to the contract... especially when some of the flakiness turned out to be our own fault, due to the (in)actions of our mortgage lender.<p>Most of the other realtors I&#x27;ve dealt with fit your description perfectly.  Nowadays, my thinking is that they&#x27;re like airline pilots -- most of the time you can take them for granted and even think about how to replace them with automated processes, but when things start to go wrong, you may find yourself appreciating their work more than you thought you would.",
                            "time": 1481325743,
                            "type": "comment",
                            "id": 13142770,
                            "by": "CamperBob2"
                        }
                    ],
                    "parent": 13140465,
                    "text": "The entire Real-Estate industry is ripe for disruption. Exactly why are we paying 6% to &quot;agents&quot;? What are &quot;agents&quot; actually doing? 10+ years ago the need for &quot;Real Estate Agents&quot; was there as information was not readily accessible. Things like &quot;what kind of area is this property in&quot;, &quot;what are schools like&quot; &quot;what are prospects for this area 5 years down the road&quot; and so on. All this information (and MUCH more) is currently readily available online. I have purchased and sold 4 homes in the last 6 years and agent I have worked with has made many tens of thousands of dollars and I can tell you with utmost precision that she hasn&#x27;t spend more than 10 hours total. My wife and I scouted locations, went to open houses, did research online for things that are important to us and finally called the agent and said &quot;we want to make an offer.&quot; Other than that the only other time we called is for her to let us into a home if there was no open house soon.<p>10+ years ago we had other &quot;agents&quot; that made a lot of money, e.g. &quot;Travel Agent&quot; in Travel&amp;Leisure industry. Then internet came along and now we have 1,000&#x27;s of websites that have replaced what Travel Agents used to do...<p>For Real-Estate I think MLS is just a start a small piece of the puzzle, someone very smart is going to disrupt the whole industry and make many billions of dollars.",
                    "time": 1481315582,
                    "type": "comment",
                    "id": 13141594,
                    "by": "bdangubic"
                },
                {
                    "kids": [
                        {
                            "parent": 13142148,
                            "text": "Could you give some more detail on what the political&#x2F;business challenges are?",
                            "time": 1481335054,
                            "type": "comment",
                            "id": 13143554,
                            "by": "jklein11"
                        }
                    ],
                    "parent": 13140465,
                    "text": "For anyone wondering, this is not a technical problem. It is a political&#x2F;business problem.<p>It&#x27;s a solved problem to make a system that stores information about home listings and transactions. Other countries have done it. Yeah, houses are annoying because of all the weird combinations. But the thing is just a CRUD app.<p>This system still exists because of organizations that are based on information asymmetry. A small group of experienced people could make a really, really nice platform for sharing real estate data in a month and it would never get anywhere.",
                    "time": 1481320200,
                    "type": "comment",
                    "id": 13142148,
                    "by": "jungrothmorton"
                },
                {
                    "parent": 13140465,
                    "text": "Good luck. I used to work at a Startup that tried wrangling MLS data. There is the not-so-trivial problem of gathering all of the data together into one schema. But to offer services on MLS data (like a forward facing website) you need to have a physical office in the MLS region your providing. This problem seems to be more legal than anything.",
                    "time": 1481323008,
                    "type": "comment",
                    "id": 13142468,
                    "by": "mosseater"
                },
                {
                    "kids": [
                        {
                            "parent": 13141176,
                            "text": "You hit the nail on the head. Having developed with MLS data before, my opinion is there&#x27;s little incentive for MLSs to make the data easy to work with. As long as each MLS gets their data distributed on the large portals that most consumers use, there&#x27;s little reward to update (read: spend money on) their systems to implement a modern format to help indie developers and startups. That&#x27;s the status quo. I don&#x27;t think anything is going to change unless the large portals band together and spearhead some kind of industry-wide effort to fix this problem.<p>As an aside, I&#x27;m working on a RE investment product that solves challenges similar to this one and I&#x27;m looking for RE investors to join me. If you&#x27;re interested, shoot me an email at hello[at]myname.com.",
                            "time": 1481322926,
                            "type": "comment",
                            "id": 13142460,
                            "by": "tylercubell"
                        }
                    ],
                    "parent": 13140465,
                    "text": "Have you seen <a href=\"https:&#x2F;&#x2F;simplyrets.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;simplyrets.com&#x2F;</a>? I haven&#x27;t used it but it looks like a great start.<p>This problem is hard to solve at the root because each MLS is independently owned and heavily influenced by the National Association of Realtors and local governments. As an active RE investor myself, I&#x27;d love to work on a problem in this space.",
                    "time": 1481312277,
                    "type": "comment",
                    "id": 13141176,
                    "by": "joshuamcginnis"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13141733,
                                    "text": "Seriously? Damn. Still, great implementation. Hope you can push the bar even higher.",
                                    "time": 1481326774,
                                    "type": "comment",
                                    "id": 13142866,
                                    "by": "mabbo"
                                }
                            ],
                            "parent": 13141183,
                            "text": "Ugh. Realtor.ca isn&#x27;t really due to standardization but monopolization and control. It&#x27;s a site by CREA (the Canadian Real Estate Assocation) and has exclusive rights to data from all member associations.<p>disclaimer: I am affiliated with rew.ca (a competitor on the west coast)",
                            "time": 1481316728,
                            "type": "comment",
                            "id": 13141733,
                            "by": "ivarv"
                        }
                    ],
                    "parent": 13140465,
                    "text": "In Canada, they standardized and built a single website. realtor.ca is, shockingly, a really great user experience when finding a new home.",
                    "time": 1481312322,
                    "type": "comment",
                    "id": 13141183,
                    "by": "mabbo"
                },
                {
                    "parent": 13140465,
                    "text": "Some friends of mine started a wordpress company a few years ago, and after some thrashing trying to find product&#x2F;market fit, they ended up pursuing real estate SEO, MLS indexing, and easy wordpress + mobile app generation. Check out <a href=\"https:&#x2F;&#x2F;wovax.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;wovax.com&#x2F;</a>",
                    "time": 1481320840,
                    "type": "comment",
                    "id": 13142230,
                    "by": "jonstaab"
                },
                {
                    "parent": 13140465,
                    "text": "A lot of them are so legacy that they &quot;require&quot; IE via a byzantine browser check that prevents modern browsers from using them.",
                    "time": 1481312187,
                    "type": "comment",
                    "id": 13141167,
                    "by": "headcanon"
                }
            ],
            "parent": 13139638,
            "text": "In real estate, developing with MLS data.<p>- There are over 900 regional MLS providers each with different schemas.<p>- You use RETS, a complicated, non web standards interface for downloading data.<p>- MLS data is plagued with errors and denormalized data making queries difficult.",
            "time": 1481306886,
            "type": "comment",
            "id": 13140465,
            "by": "seancoleman"
        },
        {
            "kids": [
                {
                    "parent": 13143303,
                    "text": "I&#x27;m intrigued!  How do you interact with these images right now? Do you display it on screen and rotate it with the mouse? Can you elaborate a bit more about how would a VR&#x2F;AR solution add value here other than being a fancier solution?",
                    "time": 1481335830,
                    "type": "comment",
                    "id": 13143594,
                    "by": "waleedka"
                }
            ],
            "parent": 13139638,
            "text": "AR&#x2F;VR visualization of 3D and 4D microscopy data (multicolor 3D video, as well as 3D point clouds over time) for biological research.<p>Look for &quot;lattice light sheet microscopy&quot; or &quot;superresolution microscopy&quot; such as (3D)-STORM or STED.<p>These techniques are adopted at a high pace. Groups spent $ 500,000 and often more on the hardware. They can produce terabytes of data within days, but we hardly have any tools to view and interact with it. (And the people are overwhelmed with the analysis.)<p>Imagine a holographic video of living cell (potentially in near real time) where you can zoom by grabbing the hologram.",
            "time": 1481331596,
            "type": "comment",
            "id": 13143303,
            "by": "cake93"
        },
        {
            "kids": [
                {
                    "parent": 13141584,
                    "text": "This would actually be fairly straight forward to launch yourself using something like <a href=\"http:&#x2F;&#x2F;cratejoy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cratejoy.com</a><p>Subscription boxes are a thing :-)",
                    "time": 1481327752,
                    "type": "comment",
                    "id": 13142964,
                    "by": "krisroadruck"
                },
                {
                    "parent": 13141584,
                    "text": "This would be fantastic for educators as well!",
                    "time": 1481320716,
                    "type": "comment",
                    "id": 13142210,
                    "by": "fudged71"
                },
                {
                    "kids": [
                        {
                            "parent": 13142106,
                            "text": "Eh I was thinking more USPS and less expectation of timeliness. More about the &quot;set it and forget it until it shows up&quot; kind of thing. Point understood though, as $10 starts to get into a competitive space (e.g. Spotify).",
                            "time": 1481320320,
                            "type": "comment",
                            "id": 13142163,
                            "by": "6stringmerc"
                        }
                    ],
                    "parent": 13141584,
                    "text": "$5 doesn&#x27;t even pay for shipping, sadly. Amazon still pays a average of $6 per order.",
                    "time": 1481319865,
                    "type": "comment",
                    "id": 13142106,
                    "by": "tomcam"
                },
                {
                    "parent": 13141584,
                    "text": "Good use of 3D printers to get started for small batches.",
                    "time": 1481328183,
                    "type": "comment",
                    "id": 13143000,
                    "by": "geuis"
                }
            ],
            "parent": 13139638,
            "text": "A monthly subscription service for a fee of $5 - $10 where every month I get a new kind of quirky instrument (shaker, wind, wood block and stick, whistle, triangle, or other noise maker) as a surprise by mail.<p>The point of the service in the music industry is to inspire new sounds and the device can either be kept or given away to somebody without a lot of second thought. Getting stuck is a big problem. Also in music it&#x27;s important to collaborate and giving gifts is a good way to make connections and impressions.<p>Great tie-in with various Manufacturers or even retailers to get rid of excess stock &#x2F; failed impulse buy items &#x2F; etc.",
            "time": 1481315533,
            "type": "comment",
            "id": 13141584,
            "by": "6stringmerc"
        },
        {
            "kids": [
                {
                    "parent": 13140626,
                    "text": "There are probably a fair number of consulting firms you can find for that.<p>But another (part of the) solution is using workflow software. Something that allows you to define and share procedures, indicate status of various taskings along the defined workflows, move data and such along. This clarifies to the employees what&#x27;s needed, and gives an opportunity for them to provide feedback for improvements (too much granularity, not enough, too inflexible, etc.). Management, then, also gets better insight into the actual status of projects and taskings. It&#x27;s part of continuous improvement to constantly be evaluating these sorts of procedures and clarifying, culling, adding to them. Management that&#x27;s unfamiliar with these concepts is just bad management.<p>In the manufacturing world, the Procedural Consulting firm would conduct &quot;lean events&quot;. (NB: Many, if not most, places do this incorrectly.)<p>The correct way is to collect metrics (meaningful) over time, encourage and reward employee feedback about ways to improve things. Then improve them (sometimes as a move across the board, but often by conducting experiments to see how well the new concepts work, then roll out to everyone). The risk is that improved efficiency will obsolete employees, some fear this (like may have actual panic attacks about this level of fear). Instead, you need a culture that sees this improved efficiency as an opportunity for growth (the same number of employees can now do more once people get retasked to new things).",
                    "time": 1481308776,
                    "type": "comment",
                    "id": 13140757,
                    "by": "Jtsummers"
                },
                {
                    "parent": 13140626,
                    "text": "I&#x27;m not sure what industry you work in or what size company, but my old department had a similar situation.<p>It sounds like your processes are either immature (no one really knows what the best way to do things is) or tribal (you have to know the right guy to talk to to find the information or knowledge you need).<p>Premature optimization is god awful, because it locks you into a world of pain - your business is inefficient and the people actually trying to follow the procedure find it incredibly painful and limiting.<p>If your process is immature, you need to invest some time   and money into finding out what the best way to do whatever it is you&#x27;re doing. If your process is tribal, you need to find the guy or guys that understand what&#x27;s happening and pick their brains about everything they know. Their implicit knowledge needs to become explicit. In my situation, I found that just agreeing on common definitions was a huge help.<p>If you&#x27;re grossly inefficient, don&#x27;t write a procedure for a bad process...you&#x27;re just ingraining inefficiency. Once you&#x27;ve found a good process, then write the procedure so you can train your people to repeat good, efficient practice.<p>And maybe most importantly, train your people to the procedure but make sure they understand it on a level so they know where it doesn&#x27;t apply and give them authority to deviate from the procedure when necessary.<p>Sorry if none of that applies to you. I&#x27;m just speaking from my few limited experiences.",
                    "time": 1481315091,
                    "type": "comment",
                    "id": 13141525,
                    "by": "analogwzrd"
                }
            ],
            "parent": 13139638,
            "text": "Not sure how much startup potential there is, but in my industry we struggle with adhering to procedures, and the root cause of that is because our procedures are written in the dark by management that doesn&#x27;t always have a complete picture or much insight into what they&#x27;re enforcing. The problem that creates is that employees only look for work-around&#x27;s for the procedures (because they are misguided or misinformed most of the time) and it creates a bigger mess than if we had no procedures at all.<p>It&#x27;s almost as though if we had a Procedural Consulting firm that could come in, look at the big picture, and help companies to create EFFICIENT and WORTHWHILE procedures that ACTUALLY do justice to the customer requirements without breaking the bank. Then they can sit everyone down and explain the procedures and enforce the assimilation that most companies usually have growing pains with.<p>I noticed that when moving to a new company that is trying to grow and achieve higher levels of accreditation. Management had intended a two-way assimilation to take place between my procedural knowledge and the procedures they already had in-place. What happened instead is old procedures are etched in stone and new ones are seen as an obstacle... The assimilation was one-way and the other middle-managers like myself are mainly concerned with keeping everything the same, despite there being improvements that could easily be made.",
            "time": 1481307930,
            "type": "comment",
            "id": 13140626,
            "by": "zelon88"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141955,
                            "text": "Do you mind sending me a message when you launch? Currently work with a bunch of engineers and technical editors and this is something we are looking to address.",
                            "time": 1481321869,
                            "type": "comment",
                            "id": 13142354,
                            "by": "snomad"
                        },
                        {
                            "kids": [
                                {
                                    "parent": 13142075,
                                    "text": "I&#x27;m expecting to get the MVP done before the end of this year.<p>The MVP is mostly targeted at businesses who have to sign&#x2F;generate contracts at scale. There&#x27;s a lot of features for those use cases, and then there&#x27;s features for users that the parent is talking about (pure contract-drafting).<p>I have not talked to any lawyers yet. I think the worst part is that I don&#x27;t even know how good the computer-skills of lawyers are, so... designing features by my competence feels wrong. Since I can design the UI to match the general structure of a contract, there&#x27;s a lot that I can add to make the user&#x27;s life easier, but it also adds more for the user to learn.",
                                    "time": 1481320947,
                                    "type": "comment",
                                    "id": 13142239,
                                    "by": "emerongi"
                                }
                            ],
                            "parent": 13141955,
                            "text": "I ran into this exact problem when selling my company. It&#x27;s horrible.<p>How far along is the product? Have you talked to any lawyers about it?",
                            "time": 1481319594,
                            "type": "comment",
                            "id": 13142075,
                            "by": "trevmckendrick"
                        }
                    ],
                    "parent": 13141566,
                    "text": "I&#x27;m actually close to launching this kind of product. A bit more complex than Word + Git, but I hope it will be worth it.<p>One question: is there a use case for live group-editing? Same way live code editors work. I have to admit that I&#x27;m not super familiar of the workflows in that industry, so I am mostly just designing features the way I would like them to work.",
                    "time": 1481318438,
                    "type": "comment",
                    "id": 13141955,
                    "by": "emerongi"
                },
                {
                    "kids": [
                        {
                            "parent": 13142471,
                            "text": "I should note - yes, my wife sees no problem at all with this workflow.<p>My understanding of the workflow is that they will send a clean copy as well as the redline to each other.  Sometimes someone will in response further modify the wrong copy, and send back, which causes problems as it becomes unclear what was accepted and what was not and someone has to manually go through and check things.  I hear that complaint come up - so I know there is at least one pain point involved.",
                            "time": 1481323696,
                            "type": "comment",
                            "id": 13142552,
                            "by": "rmrm"
                        }
                    ],
                    "parent": 13141566,
                    "text": "Be very careful trying to solve this &quot;problem&quot;.  While MS Word  change tracking may seem abhorrent to you, most lawyers are well trained in its use and are very comfortable using it.  Also, switching costs are huge.  A lawyer would not only need to see the benefit of an alternative but also convince all other lawyers they work with to put aside the solution they are already comfortable using and try something new.",
                    "time": 1481323020,
                    "type": "comment",
                    "id": 13142471,
                    "by": "takinola"
                },
                {
                    "parent": 13141566,
                    "text": "As a technical founder it&#x27;s still really strange working with top lawyers that send drafts around as word documents.",
                    "time": 1481321068,
                    "type": "comment",
                    "id": 13142248,
                    "by": "fudged71"
                },
                {
                    "parent": 13141566,
                    "text": "I think this product attempts to do that: <a href=\"http:&#x2F;&#x2F;www.pleasetech.com&#x2F;pleasereview.aspx\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pleasetech.com&#x2F;pleasereview.aspx</a><p>that said it doesn&#x27;t look all shiny and new.",
                    "time": 1481327546,
                    "type": "comment",
                    "id": 13142942,
                    "by": "krisroadruck"
                },
                {
                    "parent": 13141566,
                    "text": "You might take a look at MatterSphere.<p><a href=\"http:&#x2F;&#x2F;thomsonreuters.com&#x2F;en&#x2F;products-services&#x2F;legal&#x2F;large-law-firm-practice-and-management&#x2F;mattersphere.html\" rel=\"nofollow\">http:&#x2F;&#x2F;thomsonreuters.com&#x2F;en&#x2F;products-services&#x2F;legal&#x2F;large-l...</a>",
                    "time": 1481324271,
                    "type": "comment",
                    "id": 13142612,
                    "by": "mratzloff"
                },
                {
                    "parent": 13141566,
                    "text": "There are quite a few start-ups that have tried to solve for this. But the legal industry...",
                    "time": 1481322258,
                    "type": "comment",
                    "id": 13142393,
                    "by": "lancewiggs"
                },
                {
                    "parent": 13141566,
                    "text": "A patch centered VCS like Darcs might be a better fit for legal documents.",
                    "time": 1481328986,
                    "type": "comment",
                    "id": 13143066,
                    "by": "Avshalom"
                },
                {
                    "parent": 13141566,
                    "text": "Office 365?",
                    "time": 1481315687,
                    "type": "comment",
                    "id": 13141611,
                    "by": "quantumtremor"
                }
            ],
            "parent": 13139638,
            "text": "My wife is a corporate attorney. They pass drafts of contracts around by email using MS word with change tracking enabled.<p>Some sort of attorney targeted simple revision tracking front end using git would be a mighty step forward.",
            "time": 1481315379,
            "type": "comment",
            "id": 13141566,
            "by": "rmrm"
        },
        {
            "parent": 13139638,
            "text": "In filmmaking, there&#x27;s a space for a relatively small and potentially cheap(er) hybrid manual&#x2F;motion control grip unit. Something between a panther dolly (no tracks), a crane and a milo motion control with a stabilised head. If you&#x27;re into robotics, this is your space. Companies have started to work on these issues, but part at a time (like DJI&#x27;s Ronin). It&#x27;s not enough though.<p>Imagine a giant (3-5m reach) monitor arm that can be operated manually, but that can also remember the moves and repeat them. All of that on a mobile base that can do the same, along with a stabilisation head that can do a pitch&#x2F;roll&#x2F;yaw. Must be usable with and without power.",
            "time": 1481326247,
            "type": "comment",
            "id": 13142816,
            "by": "Keyframe"
        },
        {
            "kids": [
                {
                    "parent": 13142046,
                    "text": "I was just at slush, and I <i>think</i> one of the startup finalists was working on this problem, though honestly, it&#x27;s a pretty foreign problem to me.\nThe company is ShipWallet:\n<a href=\"http:&#x2F;&#x2F;www.shipwallet.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.shipwallet.com&#x2F;</a><p>Article about the other companies (one was doing a handheld inkjet printer for skin, that was not a normal startup pitch):\n<a href=\"http:&#x2F;&#x2F;www.slush.org&#x2F;news&#x2F;winner-slush-100-announced&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.slush.org&#x2F;news&#x2F;winner-slush-100-announced&#x2F;</a>",
                    "time": 1481319897,
                    "type": "comment",
                    "id": 13142120,
                    "by": "zilchers"
                }
            ],
            "parent": 13139638,
            "text": "This is not the industry I work in, but one of which I&#x27;m often a customer:<p><i>A turnkey package tracking system for small-to-medium shippers.</i><p>In much of the world the shipping (as in DHL, FedEx) markets are still very fragmented and do not look like they&#x27;re going to consolidate all that much. (As to why, I have guesses but I don&#x27;t know for sure.  I&#x27;m looking at Central Europe right now but I expect this is true in many other regions).<p>As far as I can tell the package tracking systems are something the companies compete on, with the result that a lot of them suck or (worst case) don&#x27;t exist.<p>Case in point: I&#x27;m currently waiting for a shipment that the seller swears they gave to the shipper, but the shipper&#x27;s system doesn&#x27;t recognize the code.  Both parties maintain it&#x27;s probably just not &quot;processed&quot; yet at the shipper&#x27;s, going on three days now.<p>As a software guy, I find it crazy that nobody has a generic white-label tracking system that any random shipper can use in combination with some smartphones&#x2F;tablets for label scanning.  It only has to cost less than the company pays the owner&#x27;s cousin&#x27;s teenage son to write the tracking PHP code these companies would otherwise use, and I bet you could upsell all kinds of premium add-ons if it worked well.<p>I would love to see this, and I think it&#x27;s a big enough market to actually accommodate a startup.",
            "time": 1481319311,
            "type": "comment",
            "id": 13142046,
            "by": "biztos"
        },
        {
            "parent": 13139638,
            "text": "It&#x27;s not my industry, but I&#x27;ve been thinking about my health habits and a WaPo article made me realize I don&#x27;t even know what a healthy weight range to target is[1]. BMI ignores bone structure and muscle and the most popular&#x2F;affordable body fat estimations are +-10%. Is there something else out there to help make an individualized weight goal? Or any other health goal?<p>[1] <a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;wonk&#x2F;wp&#x2F;2016&#x2F;12&#x2F;01&#x2F;nearly-half-of-americas-overweight-people-dont-realize-theyre-overweight&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;wonk&#x2F;wp&#x2F;2016&#x2F;12&#x2F;01&#x2F;nearl...</a>",
            "time": 1481330783,
            "type": "comment",
            "id": 13143230,
            "by": "cheriot"
        },
        {
            "kids": [
                {
                    "parent": 13140035,
                    "text": "There&#x27;s BuildingLink in this space. I think this is the kind of thing where selling software to existing, backwards organizations is a big marginal, and it might be better to <i>be</i> a property management company with good in-house systems, instead of trying to sell good systems to individual HOAs or small management companies.",
                    "time": 1481305452,
                    "type": "comment",
                    "id": 13140242,
                    "by": "tacostakohashi"
                },
                {
                    "parent": 13140035,
                    "text": "I&#x27;m on my HOA and I imagine the hardest part of making this work would actually be sales. The sales cycle for an HOA would be multiple months between meetings and actually making a decision. Then there&#x27;s the issue of rotating responsibility, retraining, no guarantees of technical skills among board volunteers.<p>I&#x27;d tend to agree with the other comments that the hired out management companies would be a much better sales target since they have a real profit motive to efficiency gains. At best a neighborhood HOA is looking at periodically saving some time and being a bit better organized.",
                    "time": 1481318440,
                    "type": "comment",
                    "id": 13141956,
                    "by": "brightball"
                },
                {
                    "parent": 13140035,
                    "text": "<a href=\"http:&#x2F;&#x2F;www.ciraconnect.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ciraconnect.com&#x2F;</a> is a fairly young company in this space...",
                    "time": 1481322164,
                    "type": "comment",
                    "id": 13142386,
                    "by": "tyingq"
                },
                {
                    "parent": 13140035,
                    "text": "I can confirm. HOA software is big.  It&#x27;s mainly managing PDFs and sending emails out.  E.g. <a href=\"https:&#x2F;&#x2F;www.condocerts.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.condocerts.com</a><p>It&#x27;s a decent industry my friend (not after this posting) makes ~300k a year working on it.  However the race may be ending as these companies lock apartment managers into long complicated contracts. Not sure how many apartment managers at scale still need.",
                    "time": 1481314994,
                    "type": "comment",
                    "id": 13141508,
                    "by": "ransom1538"
                },
                {
                    "parent": 13140035,
                    "text": "Have HOA and totally agree. So many key functions that could be improved: submit work orders and report security incidents online, pay dues and special assessments electronically, review association budget, monthly news and events, etc.<p>Problem is these who would benefit (residents) are often  disconnected from those against it (the employees). You would need boards that really are sold on the benefit.",
                    "time": 1481305815,
                    "type": "comment",
                    "id": 13140305,
                    "by": "snomad"
                },
                {
                    "parent": 13140035,
                    "text": "2 of our 3 rental properties have an HOA and its quite annoying getting postal mail about things then having to relay messages to tenants. Or you get some action to vote on but have no clue if its a good thing or not because you&#x27;re not involved in the politics part of it.",
                    "time": 1481311769,
                    "type": "comment",
                    "id": 13141119,
                    "by": "callmeed"
                },
                {
                    "kids": [
                        {
                            "parent": 13140363,
                            "text": "Homeowners Association - Might be US thing - but basically Condos &#x2F; Townhouses &#x2F; even neighborhoods form associations to take care of the &#x27;commons&#x27; &#x2F; enforce a look for the neighborhood, etc... There&#x27;s usually a monthly payment. Repairs &#x2F; work orders &#x2F; disputes are settled through them. There&#x27;s bylaws...",
                            "time": 1481306429,
                            "type": "comment",
                            "id": 13140406,
                            "by": "bigmattystyles"
                        },
                        {
                            "parent": 13140363,
                            "text": "Home Owners Association",
                            "time": 1481308473,
                            "type": "comment",
                            "id": 13140703,
                            "by": "tashmahalic"
                        }
                    ],
                    "parent": 13140035,
                    "text": "What does HOA stand for?",
                    "time": 1481306169,
                    "type": "comment",
                    "id": 13140363,
                    "by": "LeanderK"
                },
                {
                    "parent": 13140035,
                    "text": "What would your HOA pay to automate and how much would it be worth?",
                    "time": 1481304139,
                    "type": "comment",
                    "id": 13140052,
                    "by": "bmh100"
                }
            ],
            "parent": 13139638,
            "text": "Not in my industry but I&#x27;m part of an HOA and I swear 2&#x2F;3 of what the people paid to administer it do seems streamlinable&#x2F;automatable with lots of opportunity for making money along the way. Every time I deal with them I proclaim to myself, STARTUP! Then I forget about it..",
            "time": 1481303995,
            "type": "comment",
            "id": 13140035,
            "by": "bigmattystyles"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13140308,
                            "text": "For people scanning, this is a repeat of a previous comment answered elsewhere.",
                            "time": 1481311164,
                            "type": "comment",
                            "id": 13141036,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "They did its called the toaster oven.",
                    "time": 1481305832,
                    "type": "comment",
                    "id": 13140308,
                    "by": "ericcumbee"
                },
                {
                    "parent": 13140274,
                    "text": "I agree. Make Toasters Great Again.",
                    "time": 1481311549,
                    "type": "comment",
                    "id": 13141089,
                    "by": "gravity13"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "parent": 13140659,
                                            "text": "Seems a tortured equation: perhaps a vertical sandwich press without the press! I was thinking it may be possible to change the spring to another form of vertical linear actuator (eg. stepper motor driven) and giving it more controlled movement, also smarter with proximity&#x2F;LOS-style sensors. Perhaps the top cover could also expand and contract. The very fact there&#x27;s a spring-loaded release shows this is old tech. The market can clearly tolerate a few dollars for a stepper motor, as there are &#x27;smart&#x27; toasters selling for nearly ~$200USD and the bottom is ~undifferentiated. See <a href=\"http:&#x2F;&#x2F;www.brevillegroup.com.au&#x2F;wp-content&#x2F;uploads&#x2F;2016&#x2F;10&#x2F;BRG-2016-Annual-Report.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.brevillegroup.com.au&#x2F;wp-content&#x2F;uploads&#x2F;2016&#x2F;10&#x2F;B...</a>",
                                            "time": 1481310490,
                                            "type": "comment",
                                            "id": 13140967,
                                            "by": "contingencies"
                                        }
                                    ],
                                    "parent": 13140507,
                                    "text": "What you want, then, is more akin to a sandwich press rather than a toaster. Or perhaps a toaster oven. Mechanically, it&#x27;s not impossible, but the design of a toaster (spring loaded release, heating elements on either side) can&#x27;t be altered much without turning it into one of those two things (or a poor imitation of them).",
                                    "time": 1481308160,
                                    "type": "comment",
                                    "id": 13140659,
                                    "by": "Jtsummers"
                                }
                            ],
                            "parent": 13140459,
                            "text": "Your suggestion amounts to &quot;work around it&quot;. That&#x27;s one perspective, but also consider the very real problems of irregular ends of the loaf (where cutting thinner would result in a piece too small along the other two dimensions to be useful), loaves with air pockets that need to be cut thicker to maintain structural integrity (and utility) of the resulting toast, and people who simply prefer thicker slices.",
                            "time": 1481307183,
                            "type": "comment",
                            "id": 13140507,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "Cut thinner slices; the toaster doesn&#x27;t need &#x27;fixing&#x27;.",
                    "time": 1481306864,
                    "type": "comment",
                    "id": 13140459,
                    "by": "mb_72"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "kids": [
                                                {
                                                    "parent": 13140988,
                                                    "text": "Maybe you just need a small blow torch. Like they use for creme brulee",
                                                    "time": 1481327600,
                                                    "type": "comment",
                                                    "id": 13142949,
                                                    "by": "conductr"
                                                },
                                                {
                                                    "parent": 13140988,
                                                    "text": "To be fair, Australian homes need to be larger to house all the spiders.",
                                                    "time": 1481315070,
                                                    "type": "comment",
                                                    "id": 13141520,
                                                    "by": "pc86"
                                                }
                                            ],
                                            "parent": 13140680,
                                            "text": "Last I read, US homes are the second largest in the world, after Australia. In Asia, many people live in apartments and that space is unavailable &#x2F; non-negotiable. In addition, microwaves are not nearly so widely used.",
                                            "time": 1481310635,
                                            "type": "comment",
                                            "id": 13140988,
                                            "by": "contingencies"
                                        }
                                    ],
                                    "parent": 13140322,
                                    "text": "In the US, most toaster ovens I&#x27;ve seen have about 2-3 times the footprint of the average toaster, with additional height. This is actually pretty reasonable as you can use the toaster oven instead of the oven or microwave oven for many tasks (it&#x27;s a less specialised tool than a toaster).",
                                    "time": 1481308324,
                                    "type": "comment",
                                    "id": 13140680,
                                    "by": "Jtsummers"
                                },
                                {
                                    "parent": 13140322,
                                    "text": "I would say it really depends on what you are making!<p>For toast it may be energy inefficient. But if I&#x27;m just making a small pizza, etc, it&#x27;s way better than turning on the large oven.",
                                    "time": 1481320934,
                                    "type": "comment",
                                    "id": 13142237,
                                    "by": "fudged71"
                                }
                            ],
                            "parent": 13140298,
                            "text": "Sure, but it&#x27;s very space and energy inefficient.",
                            "time": 1481305887,
                            "type": "comment",
                            "id": 13140322,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "Isn&#x27;t a toaster oven a solution to this?",
                    "time": 1481305768,
                    "type": "comment",
                    "id": 13140298,
                    "by": "zackbloom"
                },
                {
                    "kids": [
                        {
                            "parent": 13141780,
                            "text": "I&#x27;ve had the same thing happen with toasters, and at least as of a few years ago it was completely possible for a piece of toast (of just the wrong size) to get stuck such that it not only didn&#x27;t pop up, the toaster didn&#x27;t turn off.  So the toast starts to burn, you grab a knife, what could possibly go wrong?<p>This happened pretty regularly as it was a European toaster designed for perfectly uniform extruded wonder-&quot;toast&quot; and I kept sticking hand-cut slices from round loaves into it.",
                            "time": 1481318790,
                            "type": "comment",
                            "id": 13141993,
                            "by": "biztos"
                        },
                        {
                            "parent": 13141780,
                            "text": "<p><pre><code>    you can always unplug it before sticking\n    utensils in there\n</code></pre>\nNot &#x27;can&#x27;, &#x27;should&#x27;.",
                            "time": 1481324736,
                            "type": "comment",
                            "id": 13142656,
                            "by": "cbr"
                        },
                        {
                            "parent": 13141780,
                            "text": "Sure. To be clear the gripe is less about the potential for a shock (real or otherwise) and more about the clearly nontrivial frequency and irritation of the issue.",
                            "time": 1481317665,
                            "type": "comment",
                            "id": 13141862,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "To be fair there shouldn&#x27;t be any voltage inside the toaster basket area when the toast has popped up. Unless they did something stupid when designing the toaster. And you can always unplug it before sticking utensils in there.",
                    "time": 1481317052,
                    "type": "comment",
                    "id": 13141780,
                    "by": "weaksauce"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13140329,
                                    "text": "I think most toasters pop up using a coiled spring.  Replacing it with a linear actuator seems like the way to do this.  Perhaps some high end toasters already use an actuator with a laser to detect if the toast is &#x27;up&#x27; enough.  Fancy stuff",
                                    "time": 1481311815,
                                    "type": "comment",
                                    "id": 13141128,
                                    "by": "api_or_ipa"
                                }
                            ],
                            "parent": 13140301,
                            "text": "Sure. In China we would use chopsticks. But my point was not that there is no viable workaround, more that the mechanical issue should be solved.<p>Perhaps it is playing too much <i>Shenzhen I&#x2F;O</i>, but I feel like a basic IC and sensors could solve this by detecting the width&#x2F;height of toast pieces and continuing to release  until the toast was substantially ejected from the toaster.",
                            "time": 1481305948,
                            "type": "comment",
                            "id": 13140329,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "I find using wood toaster tongs to be quite sufficient.<p>Mine are nothing so fancy as this image I could find online, but you get the idea.<p>A pair of popsicle sticks secured together at one end would be fine.<p><a href=\"http:&#x2F;&#x2F;ecx.images-amazon.com&#x2F;images&#x2F;I&#x2F;81HzpTQ93XL.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;ecx.images-amazon.com&#x2F;images&#x2F;I&#x2F;81HzpTQ93XL.jpg</a>",
                    "time": 1481305787,
                    "type": "comment",
                    "id": 13140301,
                    "by": "no_protocol"
                },
                {
                    "kids": [
                        {
                            "parent": 13141861,
                            "text": "&gt;$189<p>I bought my bottom of the barrel Wal-Mart toaster for $6 about 8 years ago. It might occasionally have issues popping out a piece of bread but it cost $6 and it toasts bread consistently.<p>I&#x27;m mostly holding on to this thing to prove a point to the &quot;they don&#x27;t make them like they used to&quot; and the &quot;you have to spend at least $100+ on X or else it will break in a week&quot; crowd. I know it isn&#x27;t the best toaster out there but I&#x27;d take it over a $189 toaster even if both were offered for free just because I&#x27;d feel like an idiot for having something so ostentatious on my countertop.",
                            "time": 1481321781,
                            "type": "comment",
                            "id": 13142335,
                            "by": "cc439"
                        },
                        {
                            "parent": 13141861,
                            "text": "Lots of very bad reviews.",
                            "time": 1481318598,
                            "type": "comment",
                            "id": 13141974,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "&gt; Someone should really fix toasters.<p>They have. They&#x27;re called dualit.<p><a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;Dualit-20293-2-Slice-Toaster-Chrome&#x2F;dp&#x2F;B00009NROG&#x2F;ref=sr_1_1?ie=UTF8&amp;qid=1481317694&amp;sr=8-1&amp;keywords=dualit+toaster\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;Dualit-20293-2-Slice-Toaster-Chrome&#x2F;d...</a>",
                    "time": 1481317638,
                    "type": "comment",
                    "id": 13141861,
                    "by": "DanBC"
                },
                {
                    "kids": [
                        {
                            "parent": 13140418,
                            "text": "With irregular pieces on this and other toasters I have used, part of one piece of toast can block the further vertical motion of the carriage at the top portion of its linear range.",
                            "time": 1481306799,
                            "type": "comment",
                            "id": 13140448,
                            "by": "contingencies"
                        }
                    ],
                    "parent": 13140274,
                    "text": "Did pulling the lever up not push the toast out?",
                    "time": 1481306562,
                    "type": "comment",
                    "id": 13140418,
                    "by": "IanCal"
                },
                {
                    "time": 1481305864,
                    "id": 13140316,
                    "parent": 13140274,
                    "deleted": true,
                    "type": "comment"
                },
                {
                    "kids": [
                        {
                            "parent": 13140422,
                            "text": "Then he will complain that his normal sized slices don&#x27;t toast efficiently enough in one of those.",
                            "time": 1481326085,
                            "type": "comment",
                            "id": 13142805,
                            "by": "q3r3qr3q"
                        }
                    ],
                    "parent": 13140274,
                    "text": "They make toasters for oversized slices.",
                    "time": 1481306600,
                    "type": "comment",
                    "id": 13140422,
                    "by": "HeyLaughingBoy"
                }
            ],
            "parent": 13139638,
            "text": "Normally I live in China, and rarely eat western breakfast.<p>Recently I returned to Australia to spend some Christmas time with my extended family.<p>A few mornings ago, I put some real bread I cut from a sourdough loaf in a toaster. Due to its irregular size, when it popped it didn&#x27;t pop out completely, resulting in a sort of &quot;toaster is too hot to insert fingers, toast is too hot to hold, toast is ready, find metallic implement to insert in to mains-powered device to extract toast&quot; problem.<p>I mentally facepalmed.<p>Someone should really fix toasters.",
            "time": 1481305597,
            "type": "comment",
            "id": 13140274,
            "by": "contingencies"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141461,
                            "text": "Is your talk up somewhere? That sounds very interesting.",
                            "time": 1481315193,
                            "type": "comment",
                            "id": 13141539,
                            "by": "pc86"
                        },
                        {
                            "parent": 13141461,
                            "text": "I think it is also partly because any inefficiency in work leads to an increase in the Billable Hour. When it makes you more money it isn&#x27;t really broken.",
                            "time": 1481322627,
                            "type": "comment",
                            "id": 13142427,
                            "by": "cynusx"
                        }
                    ],
                    "parent": 13140511,
                    "text": "I&#x27;m a lawyer and a programmer and run a legal-tech startup. The largest issue I&#x27;ve found with lawyers and technology is that they don&#x27;t understand it, and there is a lot of fear around it.<p>Most of the time I spent selling my software was assuaging the risk-averse mindset that exists in the profession, rather than advertising the benefits. I actually gave a TEDx talk on this point as I think it&#x27;s an enormous issue in the industry.<p>So the ease of creating the software isn&#x27;t the issue, it&#x27;s the culture. That said, legal tech now has a pretty healthy ecosystem which is a delight to see!",
                    "time": 1481314539,
                    "type": "comment",
                    "id": 13141461,
                    "by": "ruairidhwm"
                },
                {
                    "parent": 13140511,
                    "text": "<i>tech system to manage and track work</i><p>This is an exceedingly hard problem unless 100% of your work is input through a revision control system.",
                    "time": 1481313059,
                    "type": "comment",
                    "id": 13141291,
                    "by": "AndrewKemendo"
                },
                {
                    "parent": 13140511,
                    "text": "Very true. We are building a platform to solve this problem at Apperio (<a href=\"https:&#x2F;&#x2F;www.apperio.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.apperio.com</a>).",
                    "time": 1481320485,
                    "type": "comment",
                    "id": 13142184,
                    "by": "stephenwilcock"
                },
                {
                    "kids": [
                        {
                            "parent": 13141146,
                            "text": "Here&#x27;s another product used by major law firms called &quot;Carpe Diem&quot;: <a href=\"https:&#x2F;&#x2F;www.tikit.com&#x2F;products&#x2F;large-law-firms&#x2F;time-recording-carpe-diem&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tikit.com&#x2F;products&#x2F;large-law-firms&#x2F;time-recordin...</a>",
                            "time": 1481315549,
                            "type": "comment",
                            "id": 13141586,
                            "by": "a3camero"
                        }
                    ],
                    "parent": 13140511,
                    "text": "Most law firms, even small ones, use &#x27;Time Matters&#x27;; it&#x27;s actually quite sophisticated and is now a De Facto standard for the industry.",
                    "time": 1481311950,
                    "type": "comment",
                    "id": 13141146,
                    "by": "david927"
                }
            ],
            "parent": 13139638,
            "text": "Not my industry, but a friend of mine in law was discussing how incredible her in-house software is for managing billable hours relative to all her past companies. I poked around, and most law firms, even very deep pocketed ones, use somewhere between a bad tech system and no tech system to manage and track their work.<p>A small team could easily collaborate with some law firm (maybe take an investment from a few law firms), and create some very valuable software.",
            "time": 1481307208,
            "type": "comment",
            "id": 13140511,
            "by": "kolbe"
        },
        {
            "parent": 13139638,
            "text": "There&#x27;s probably a SaaS in locksmithing.<p><a href=\"http:&#x2F;&#x2F;masterkeypro.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;masterkeypro.com&#x2F;</a> is sort of the only entry in the market and cores&#x2F;companies-that-need-key-schedules change <i>just</i> often enough that say $5-10 month could gain traction.",
            "time": 1481321783,
            "type": "comment",
            "id": 13142336,
            "by": "Avshalom"
        },
        {
            "kids": [
                {
                    "parent": 13142145,
                    "text": "I&#x27;m not sure I really understand what you&#x27;re describing. Is this like buying an annuity tied to lifespan and a tax subsidy to encourage it?",
                    "time": 1481321639,
                    "type": "comment",
                    "id": 13142319,
                    "by": "cheriot"
                }
            ],
            "parent": 13139638,
            "text": "Government should allow company to pay part of the salary as life long Income bond. Company will have tax credit for that. Government will pay them fixed monthly income depend upon value of bond. I.e. Deferred inflation. But this can solve minimum income idea very easily.",
            "time": 1481320180,
            "type": "comment",
            "id": 13142145,
            "by": "iamgopal"
        },
        {
            "parent": 13139638,
            "text": "Bret Victor-style dashboard and visualisation systems. I &#x27;ve been using Qlikview, Tableau and Excel for years and they are all very limited in what they can do. New dashboard solutions come out every hour but everyone is copying each other. I want something that I can mould to my problem, that I can touch and fully interact with. Hard, hard problem but worth spending time on this. Make it work in real-time scenarios too please.",
            "time": 1481324854,
            "type": "comment",
            "id": 13142661,
            "by": "ninjamayo"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141173,
                            "text": "300 years ago, when Benjamin Franklin traveled from Philadelphia to Boston, the trip took two weeks. The fastest mode of travel was by boat, and he nearly died in a boat wreck.",
                            "time": 1481315008,
                            "type": "comment",
                            "id": 13141511,
                            "by": "nhebb"
                        }
                    ],
                    "parent": 13140582,
                    "text": "You&#x27;re being facetious but maybe you should actually consider the history behind that sort of thing.<p>Yesterday my friend in LA invited a few of us in Toronto to come to his BBQ this weekend. The group chat became us discussing the logistics and price of how we might do that. 150 years ago, that would have been an insane concept.",
                    "time": 1481312264,
                    "type": "comment",
                    "id": 13141173,
                    "by": "mabbo"
                },
                {
                    "parent": 13140582,
                    "text": "How about a Friday in 2075 and a Monday in 2091?",
                    "time": 1481314396,
                    "type": "comment",
                    "id": 13141441,
                    "by": "pc86"
                },
                {
                    "parent": 13140582,
                    "text": "How about a virtual vacation?<p><a href=\"http:&#x2F;&#x2F;www.imdb.com&#x2F;title&#x2F;tt0100802&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.imdb.com&#x2F;title&#x2F;tt0100802&#x2F;</a>",
                    "time": 1481321498,
                    "type": "comment",
                    "id": 13142301,
                    "by": "buckbova"
                },
                {
                    "time": 1481315962,
                    "id": 13141641,
                    "parent": 13140582,
                    "deleted": true,
                    "type": "comment"
                }
            ],
            "parent": 13139638,
            "text": "Tech industry: I want to be able to go to Mars for the weekend... leaving on Friday and coming back early Monday morning.<p>This is still a big problem in tech industry.",
            "time": 1481307657,
            "type": "comment",
            "id": 13140582,
            "by": "shinamee"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142263,
                            "text": "Seemed pretty immature last I looked at it a year or two ago, but I can give it a other spin.<p>One-time pricing and a DRM scheme that involves obfuscated PHP files also makes me little nervous.",
                            "time": 1481321609,
                            "type": "comment",
                            "id": 13142312,
                            "by": "eli"
                        }
                    ],
                    "parent": 13142246,
                    "text": "Check out Sendy - <a href=\"https:&#x2F;&#x2F;sendy.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sendy.co&#x2F;</a>",
                    "time": 1481321146,
                    "type": "comment",
                    "id": 13142263,
                    "by": "aj0strow"
                }
            ],
            "parent": 13139638,
            "text": "It&#x27;s still surprisingly hard to send email newsletters. I want software or a service that sits on top of mailgun&#x2F;ses&#x2F;my own SMTP server and handles list management, templating, link redirection, and analytics. And that stores everything in a way that makes further data mining easy.<p>Lots of services solved the just sending email part. And lots of mailchimp type services offer a complete product geared towards marketers. Not much in between and most existing players have laughably poor APIs that make custom integrations and extensions painful.",
            "time": 1481321035,
            "type": "comment",
            "id": 13142246,
            "by": "eli"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142348,
                            "text": "In linux land, there is Teleport, which is relatively new. There are probably some other options, but I liked the POC I did with teleport, it just needs to mature a hair.<p>In windows land.....I&#x27;ve got nothing, hence the problem.<p>- <a href=\"https:&#x2F;&#x2F;gravitational.com&#x2F;teleport&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gravitational.com&#x2F;teleport&#x2F;</a>",
                            "time": 1481323708,
                            "type": "comment",
                            "id": 13142554,
                            "by": "jdc0589"
                        }
                    ],
                    "parent": 13142235,
                    "text": "I feel like this is a common&#x2F;old enough problem there should be some open sourced solutions for it already.",
                    "time": 1481321823,
                    "type": "comment",
                    "id": 13142348,
                    "by": "bduerst"
                }
            ],
            "parent": 13139638,
            "text": "Industry: Any tech company that hosts sensitive&#x2F;regulated data.<p>The problem: privlidged access management and auditing.<p>The solution: Cyberark, but not $250k to cover 1,000 servers. Ain&#x27;t nobody got money for that.",
            "time": 1481320899,
            "type": "comment",
            "id": 13142235,
            "by": "jdc0589"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142473,
                            "text": "New Relic was the inspiration for this idea. I shouldn&#x27;t have to put my data into NR to get value, the data is already either in my app&#x27;s DB or running through my app. There are actually a lot of reasons why having it be installed and within the app itself is ideal, opens up many doors that are closed by NR. I want something that starts with that as a first principle and then figures out the way to best execute it.<p>Will check out Looker!",
                            "time": 1481333666,
                            "type": "comment",
                            "id": 13143478,
                            "by": "tommynicholas"
                        }
                    ],
                    "parent": 13142166,
                    "text": "Newrelic is converging on this. Also you should take a look at Looker.",
                    "time": 1481323028,
                    "type": "comment",
                    "id": 13142473,
                    "by": "teej"
                }
            ],
            "parent": 13139638,
            "text": "BI for developers. Developers run many organizations and teams now, but most Business Intelligence-ish tools are either built for business people (Tableau, Domo) or for marketing (all analytics products, specifically GA).<p>I feel like there&#x27;s a big opportunity for a tool&#x2F;tools that are installed in apps as a package and then customized from there. Many teams build a version of this in house (Instacart open-sources theirs), and I think it should be a product.",
            "time": 1481320331,
            "type": "comment",
            "id": 13142166,
            "by": "tommynicholas"
        },
        {
            "kids": [
                {
                    "parent": 13141655,
                    "text": "I wonder if shipping containers could be the basis for a solution in this space.",
                    "time": 1481330695,
                    "type": "comment",
                    "id": 13143218,
                    "by": "andrewl"
                }
            ],
            "parent": 13139638,
            "text": "Not my industry, but in my area.  I&#x27;m still looking for a good modular house that can be setup reasonably quickly, low cost, and can survive North Dakota winter and summer.  Something suitable for a single person or a couple.",
            "time": 1481316079,
            "type": "comment",
            "id": 13141655,
            "by": "protomyth"
        },
        {
            "kids": [
                {
                    "parent": 13142645,
                    "text": "It exists in the form of them and other suppliers providing cad for everything",
                    "time": 1481326766,
                    "type": "comment",
                    "id": 13142864,
                    "by": "notananthem"
                }
            ],
            "parent": 13139638,
            "text": "An easy way to design things using catalog mechanical parts.<p>I imagine being able to create a structure or assembly from stuff in the McMaster-Carr or ThorLabs catalogs without having to be a CAD expert. When I&#x27;m satisfied with the thing on my screen, I press a button, enter my credit card number, and the parts arrive from their respective vendors in a couple days.<p>A search feature would be vital, of course. Being able to modify some parts would be useful, e.g., if I need 14 inches of pipe, I can cut down a 24 inch piece. Drawing from multiple disciplines would be necessary, e.g., combining an electrical box, optical assembly, and structural framework.<p>Maybe you get paid via a little kickback from those vendors, who also agree to integrate their catalogs with your service.",
            "time": 1481324579,
            "type": "comment",
            "id": 13142645,
            "by": "analog31"
        },
        {
            "parent": 13139638,
            "text": "I&#x27;m in the AI industry and our problem is that we have so little grasp on what intelligence actually is, that we stumble in getting our machines to mimic portions of human cognition even on the vector space level.",
            "time": 1481305164,
            "type": "comment",
            "id": 13140203,
            "by": "earthly10x"
        },
        {
            "parent": 13139638,
            "text": "One problem from my past experience at architecture industry:\nevery country has it own rules &amp; regulations for represent drawings of designs(documentation)(many small things like floor plans, sizes, fonts, frames, symbols descriptions all are different) as result CAD software developed in one country very hard to use in another without lot of weird tricks which works only for subset of original functionality.\nI believe it may be solved be separating actual building model and view&#x2F;render representation like AST and interpreter. But unfortunately is super hard to do just because that AST model should include lot of complex stuff.",
            "time": 1481321832,
            "type": "comment",
            "id": 13142350,
            "by": "strobe"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142077,
                            "text": "Gmail extracts data from emails with certain tags in it, microformats or one of those standars. I think OP is talking about something more flexible using nlp.",
                            "time": 1481335317,
                            "type": "comment",
                            "id": 13143564,
                            "by": "tomascot"
                        }
                    ],
                    "parent": 13141786,
                    "text": "Doesn&#x27;t GMail do this already? It&#x27;s not perfect but it extracts data such as plane tickets or hotel reservations and saves those to your calendar.",
                    "time": 1481319599,
                    "type": "comment",
                    "id": 13142077,
                    "by": "endisukaj"
                }
            ],
            "parent": 13139638,
            "text": "Email parsing and extracting data from it, (input data in multiple languages), that is not strictly depending on predefined templates but being able to adjust itself. Think parsing emails from multiple providers of certain kind of service and exposing common data model. Looks like perfect usage of machine learning.",
            "time": 1481317096,
            "type": "comment",
            "id": 13141786,
            "by": "jakub_g"
        },
        {
            "kids": [
                {
                    "parent": 13141693,
                    "text": "Why on earth would anyone want their CDN traffic to drop? Rise in traffic usually comes with a rise in revenue - it&#x27;s a good problem to have.",
                    "time": 1481324292,
                    "type": "comment",
                    "id": 13142616,
                    "by": "artursapek"
                }
            ],
            "parent": 13139638,
            "text": "Global CDN with a fixed monthly cost and a capped bandwidth. For example, pay 100$&#x2F;month and get up to 1Gb&#x2F;s, traffic above this limit is dropped.<p>Providers today offer uncapped bandwidth, some, like Amazon, without any cost cap, some, like KeyCDN, allow to set a cost cap, but take the resources off-line when the limit is exceeded.",
            "time": 1481316388,
            "type": "comment",
            "id": 13141693,
            "by": "mixedbit"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13142490,
                            "text": "I left Hull&#x2F;Texas in April 2015 but if you want to bug somebody <a href=\"http:&#x2F;&#x2F;hullsupply.com&#x2F;page&#x2F;contact&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;hullsupply.com&#x2F;page&#x2F;contact&#x2F;</a><p>ask to be transferred to Gabe, I&#x27;m sure he&#x27;s still IT there.<p>P.S. I don&#x27;t know if he&#x27;ll remember the name but Axel -from the cage and lockshop- if you want a name to drop.",
                            "time": 1481323499,
                            "type": "comment",
                            "id": 13142523,
                            "by": "Avshalom"
                        }
                    ],
                    "parent": 13142387,
                    "text": "Can we get in touch? Currently building something in this space and would like to understand your problem better. My email is in my profile!",
                    "time": 1481323171,
                    "type": "comment",
                    "id": 13142490,
                    "by": "Axsuul"
                }
            ],
            "parent": 13139638,
            "text": "It&#x27;s not really start up material but Sage&#x2F;MAS is basically crap for companies that need custom work. The door warehouse I worked at  basically needed 2-3 parallel system (1-2 of them being us scribbling on paper) because we custom fabricated doors and MAS was basically useless for passing that kind of thing around.<p>P.S. If any of you are in Austin I recommend Hull Supply, they&#x27;re good people.",
            "time": 1481322168,
            "type": "comment",
            "id": 13142387,
            "by": "Avshalom"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141882,
                            "text": "That would better be served with AR, no?",
                            "time": 1481322066,
                            "type": "comment",
                            "id": 13142370,
                            "by": "bduerst"
                        }
                    ],
                    "parent": 13141873,
                    "text": "What about VR for surgery training?",
                    "time": 1481317818,
                    "type": "comment",
                    "id": 13141882,
                    "by": "rubicon33"
                }
            ],
            "parent": 13139638,
            "text": "One of the best places to look is where an emerging platform overlaps with existing specialty fields. For example, VR is currently an emerging platform, here&#x27;s a few things that maybe someone is pursuing but there&#x27;s no established solution for:<p>- 3D Storyboarding for VR cinematic storytelling (mixed desktop&#x2F;VR)<p>- VR home tours for real estate<p>- VR sports training for golf&#x2F;tennis&#x2F;baseball<p>- Rehearsal&#x2F;Staging VR for event planning.<p>- VR Training for DIY&#x2F;Construction.<p>etc.. In particular if there is a field that you personally work in or know someone that&#x27;s a great place to start.",
            "time": 1481317712,
            "type": "comment",
            "id": 13141873,
            "by": "joeld42"
        },
        {
            "kids": [
                {
                    "parent": 13142136,
                    "text": "I bookmarked a few gmail apps for this a while back, though have not used them myself. Does either of these look like what you are after?<p><a href=\"https:&#x2F;&#x2F;www.wizy.io&#x2F;solutions&#x2F;gmail_workflow.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wizy.io&#x2F;solutions&#x2F;gmail_workflow.html</a>\n<a href=\"https:&#x2F;&#x2F;kissflow.com&#x2F;how-it-works&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;kissflow.com&#x2F;how-it-works&#x2F;</a>",
                    "time": 1481322830,
                    "type": "comment",
                    "id": 13142445,
                    "by": "gary__"
                },
                {
                    "parent": 13142136,
                    "text": "Can you elaborate some more?",
                    "time": 1481323688,
                    "type": "comment",
                    "id": 13142551,
                    "by": "DrJid"
                },
                {
                    "parent": 13142136,
                    "text": "Could you give examples of the current offerings you refer to?",
                    "time": 1481329539,
                    "type": "comment",
                    "id": 13143116,
                    "by": "oheard"
                },
                {
                    "parent": 13142136,
                    "text": "can you elaborate a bit?",
                    "time": 1481324101,
                    "type": "comment",
                    "id": 13142595,
                    "by": "LeanderK"
                }
            ],
            "parent": 13139638,
            "text": "A request&#x2F;approval system. The current offerings are laughably unusable.",
            "time": 1481320062,
            "type": "comment",
            "id": 13142136,
            "by": "scaramouche"
        },
        {
            "kids": [
                {
                    "parent": 13142382,
                    "text": "I bought display ads in Nature (the journal) a while back. There&#x27;s no way to purchase without talking to a salesperson. However, I expect they want to keep it this way.",
                    "time": 1481324221,
                    "type": "comment",
                    "id": 13142604,
                    "by": "paulrosenzweig"
                },
                {
                    "kids": [
                        {
                            "parent": 13142424,
                            "text": "Yes, something similar to AdWords.  Which Google previously did do, but then cancelled it. <a href=\"http:&#x2F;&#x2F;betanews.com&#x2F;2007&#x2F;04&#x2F;16&#x2F;google-s-ad-moves-ruffle-feathers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;betanews.com&#x2F;2007&#x2F;04&#x2F;16&#x2F;google-s-ad-moves-ruffle-feat...</a><p>I want my pool cleaning guy to be able to go online and buy a radio commercial advertising his business.  If he has to go through a salesperson and negotiate and all that, you&#x27;ve already lost him.<p>I think there is a ton of money sitting on the table waiting to be claimed for this opportunity.",
                            "time": 1481326945,
                            "type": "comment",
                            "id": 13142884,
                            "by": "starik36"
                        },
                        {
                            "parent": 13142424,
                            "text": "I think the poster meant Adwords or some similar self-serve solution.",
                            "time": 1481324259,
                            "type": "comment",
                            "id": 13142611,
                            "by": "paulrosenzweig"
                        }
                    ],
                    "parent": 13142382,
                    "text": "Isn&#x27;t this what ad agencies are supposed to do? Or are you saying you want a digital-only ad agency, like Adwords, except for radio?",
                    "time": 1481322573,
                    "type": "comment",
                    "id": 13142424,
                    "by": "jdavis703"
                }
            ],
            "parent": 13139638,
            "text": "Radio Industry.  I know it&#x27;s a slowly dying business, but that&#x27;s because the giants are too slow to turn.<p>I want to be able to go to a website, ask for demographics that I am looking for and be able to purchase an advertisement and hire talent to record my commercial.<p>As it stands, you have to deal with salespeople.",
            "time": 1481322147,
            "type": "comment",
            "id": 13142382,
            "by": "starik36"
        },
        {
            "kids": [
                {
                    "parent": 13142155,
                    "text": "What kind of robots are you talking about?",
                    "time": 1481330448,
                    "type": "comment",
                    "id": 13143204,
                    "by": "digikata"
                },
                {
                    "parent": 13142155,
                    "text": "Might be good to chat with you. We&#x27;re working on Asteria. Happy to reach out.",
                    "time": 1481321659,
                    "type": "comment",
                    "id": 13142321,
                    "by": "lowglow"
                }
            ],
            "parent": 13139638,
            "text": "(AI research industry)<p>We&#x27;d like to run learning algorithms on robots, but there are  no great options for hardware. (Happy to discuss in depth if someone wants to build it)<p>We want to train large models much faster than any GPU box you can buy. (There are several new things announced, but there&#x27;s room for more).",
            "time": 1481320282,
            "type": "comment",
            "id": 13142155,
            "by": "tlb"
        },
        {
            "kids": [
                {
                    "parent": 13140249,
                    "text": "As a user, I&#x27;m not a fan of this.<p>1) how about you find ways to make retention a continuous objective\n2) get used to the fact that not all customers will be retained. I try stuff all the time that I have no idea if it will solve my specific problem. If you do #1 right, I would know that you want to hear about my specific problems and offer ideas on how your saas can solve them. That&#x27;s the most you can hope for if your service doesn&#x27;t immediately do what I initially hoped it would (or is more burdensome to implement that I thought, etc)",
                    "time": 1481319115,
                    "type": "comment",
                    "id": 13142025,
                    "by": "conductr"
                },
                {
                    "kids": [
                        {
                            "parent": 13140716,
                            "text": "The more anti-consumer way would be to just pipe every URL back home in real time.",
                            "time": 1481316245,
                            "type": "comment",
                            "id": 13141671,
                            "by": "pc86"
                        }
                    ],
                    "parent": 13140249,
                    "text": "I can think of a solution that&#x27;s VERY VERY anti-consumerish.<p>Being a SaaS provider, create an extensions that you have to install (something consumers want...). This extension should have the permissions to read history &#x2F; or urls visiting.<p>Have a blacklist transmitted of urls (so you don&#x27;t need to transfer the user&#x27;s data back to the server) and match with it. If it matches...you have to work on that consumer a lot more.",
                    "time": 1481308537,
                    "type": "comment",
                    "id": 13140716,
                    "by": "ohstopitu"
                },
                {
                    "kids": [
                        {
                            "parent": 13140269,
                            "text": "I am ok with my competitors using the same Adwords or other marketing tools I use so I am not sure why this would be different.",
                            "time": 1481306781,
                            "type": "comment",
                            "id": 13140446,
                            "by": "takinola"
                        },
                        {
                            "kids": [
                                {
                                    "parent": 13140345,
                                    "text": "Or as this is otherwise known, &quot;spying on your customers.&quot;",
                                    "time": 1481316176,
                                    "type": "comment",
                                    "id": 13141664,
                                    "by": "pc86"
                                }
                            ],
                            "parent": 13140269,
                            "text": "You could employ some sneaky tactics to ferret out if a customer&#x27;s browser visits a competitor&#x27;s website... without letting the competitors or the custom know.",
                            "time": 1481306052,
                            "type": "comment",
                            "id": 13140345,
                            "by": "devoply"
                        }
                    ],
                    "parent": 13140249,
                    "text": "As a SaaS provider, would you be ok with having your competitors find out when one of their customers signs up with you?",
                    "time": 1481305568,
                    "type": "comment",
                    "id": 13140269,
                    "by": "tacostakohashi"
                },
                {
                    "parent": 13140249,
                    "text": "This sounds like a massive invasion of privacy, to me. It also sounds like a great opportunity to drive customers further away when you contact them based on that information.",
                    "time": 1481319651,
                    "type": "comment",
                    "id": 13142087,
                    "by": "kedean"
                },
                {
                    "parent": 13140249,
                    "text": "I think you can do that with BuiltWith&#x2F;Datanyze&#x2F;NerdyData. Sales people use it to see when someone is trialing with a competitor.",
                    "time": 1481312613,
                    "type": "comment",
                    "id": 13141225,
                    "by": "callmeed"
                }
            ],
            "parent": 13139638,
            "text": "As a SaaS provider, one of the key indicators of a customer at risk of churn is the presence of another competitor in their account.  A service which notifies you once an account signs up for a competing service would be immensely valuable in helping to target retention activities.",
            "time": 1481305476,
            "type": "comment",
            "id": 13140249,
            "by": "takinola"
        },
        {
            "parent": 13139638,
            "text": "Industrial heat treating.  PID controllers with expansive reporting software.  Whole industry is scrambling right now to make their own or buy systems upwards of 10K.<p>Think Wi-Fi thermostats that record data.",
            "time": 1481324082,
            "type": "comment",
            "id": 13142593,
            "by": "frodprefect"
        },
        {
            "kids": [
                {
                    "parent": 13141802,
                    "text": "We started StartupCTO.io as a way to address this. We saw the same lack of support for CS grads thrust into leadership, so we&#x27;re doing something about it.",
                    "time": 1481317547,
                    "type": "comment",
                    "id": 13141848,
                    "by": "miles_matthias"
                }
            ],
            "parent": 13139638,
            "text": "Work in software, key problem in my industry is a lack of leadership.",
            "time": 1481317200,
            "type": "comment",
            "id": 13141802,
            "by": "fatdog"
        },
        {
            "parent": 13139638,
            "text": "Finance, specifically fixed income:<p>Regulations will unbundle research from liquidity provision starting sometime in 2018 (moving regulatory target, but theme seems clear). Sellside will have lower incentive to pay large research groups; buyside will have to pay explicit fees for research advisory. There is a big opportunity in providing platforms, with macro and market data live, where researchers can interact with capital managers, given that said researchers will likely find themselves bereft of their current distribution networks (bank sales forces) sometime in the next few years.<p>Equities already have a hybrid form of this where buyside earns &quot;credits&quot; to be allocated at the end of each year to research providers. But fixed income is at least twice as big as equities, is much more opaque because is essentially unlisted (mainly &quot;OTC&quot; = &quot;over the counter&quot; ie only those in the know), and therefore much more susceptible to disruption.",
            "time": 1481316250,
            "type": "comment",
            "id": 13141673,
            "by": "vegabook"
        },
        {
            "kids": [
                {
                    "parent": 13141632,
                    "text": "Great ideas. Some thoughts:<p>GP offices: Plenty of solutions already - generally regionally based or by payer. Also an issue with vets, hairdressers etc - pick an appointment based niche. (Have invested in 2 niches, advised others)<p>Wireless sensors for industry: Thousands of players here, including network providers and different tech stacks. The game is to find a niche that is easy to enter and pats well. (Have invested in wireless water metering, advised others)<p>Drone inspection: Plenty of players here, but it&#x27;s a find-a-niche that you can sell to play, and you need operators for each application. (Have advised drone and drone application companies)<p>Anything on a drone: Drone&#x27;s don&#x27;t last long in the sky. (as above)<p>Trains: Trains get solved at the political level. Good luck in the USA. (am train lobbyist)<p>Motorbike safety: Check out where Dainese and BMW are going - air bags et al. I spend a fortune on BMW gear. (Motorcyclist)<p>GUI HUDs: The main player failed (Skully - internal issues) . I know of at least one early stage company attempting a generic HUD solution. (have met, not invested the early stage one and decided, luckily, that I didn&#x27;t like the Skully people and did not pre-order.)<p>Motorbike storage: Has been a huge market since the 90s when you could only get adventure boxes from one supplier - in Munich. Now the problem is solved by countless suppliers and manufacturers - unless you buy a sports bike, which have a very different use-case. My first adventure trip was in 98 and I needed to self-assemble, now you can ride out of several branded dealerships with a capable round the world bike. (have motorbiked round what world - in pieces)<p>VR: The use-case is really only games so far. See Playstation. (have 2 VR kits)<p>Lighter than Air: Capacity and cost versus shipping are the issue, while air-cargo is well solved. Meanwhile the Helium market is stuffed. But I love the industry too. (read Bill Gate&#x27;s recommended book on international shipping etc.)<p>Low income cooking: Those low income people are time-poor, poorly educated (the US system is dreadful) and marketed too by monster franken-food companies that price under the cost of decent food. Yes - its a hard problem to solve. (don&#x27;t get me started)<p>Education: Indeed. Start with politics and how schools are funded.<p>Taiwan: (sadly) Why would you pay more than $1 over market?",
                    "time": 1481323812,
                    "type": "comment",
                    "id": 13142559,
                    "by": "lancewiggs"
                },
                {
                    "time": 1481321731,
                    "id": 13142330,
                    "parent": 13141632,
                    "deleted": true,
                    "type": "comment"
                },
                {
                    "kids": [
                        {
                            "kids": [
                                {
                                    "parent": 13142596,
                                    "text": "Ok, thanks. Work for myself so did not connect to PTO which should be obvious in retrospect",
                                    "time": 1481330604,
                                    "type": "comment",
                                    "id": 13143212,
                                    "by": "tomcam"
                                }
                            ],
                            "parent": 13142266,
                            "text": "Apologies, I hate when people do that to me.<p>EPC means &quot;engineering, procurement, and construction&quot; company. So like, lyondell-basell or jacobs engineering or foster wheeler (now AMEC) or Mustang (not the car) or KBR.<p>PTO = Paid Time Off. Catchall for vacation time, sick time, holidays.",
                            "time": 1481324139,
                            "type": "comment",
                            "id": 13142596,
                            "by": "komali2"
                        },
                        {
                            "parent": 13142266,
                            "text": "Perhaps &quot;earning per click&quot; and &quot;paid time off.&quot;",
                            "time": 1481321785,
                            "type": "comment",
                            "id": 13142338,
                            "by": "buckbova"
                        }
                    ],
                    "parent": 13141632,
                    "text": "Wow! You&#x27;ve got range. What are EPC and PTO?",
                    "time": 1481321175,
                    "type": "comment",
                    "id": 13142266,
                    "by": "tomcam"
                }
            ],
            "parent": 13139638,
            "text": "Many doctor offices still have horrifying paper record systems, don&#x27;t use e-invites, etc. Companies are fixing this but the market is still huge.<p>I don&#x27;t know why the few companies that are in the IoT space for oil and gas aren&#x27;t scooping up literally <i>billions</i> in missed opportunities for sticking cell-enabled sensors on oil platforms, fields, etc. Then there&#x27;s the next billion dollars waiting for whoever starts sticking controllers next to the sensors on valves, etc.<p>Drone inspection and repair in oil and gas. People are doing this but it&#x27;s taking way too long to take off for how much money is there just waiting to be picked up.<p>Sticking a laser scanner on a drone. Again, people are doing it, but what the fuck, there&#x27;s <i>so much money</i> just sitting there.<p>If you&#x27;re looking for contract work, just start browsing random EPC websites and calling up the shitty ones. Probably a good 10,000 at least that are still rocking 1995 crapsites, and not in the &quot;good&quot; &quot;low functionality low load time&quot; way, the &quot;using tables for layout&quot; way.<p>Trains should be automated. They already are in Taiwan for some lines, it&#x27;s been feasible for years.<p>Motorcycle safety is still subpar for where we are in material science. There are a lot of riders out there that will pay <i>buckets</i> for greater safety. We&#x27;ve figured out how to not get our skin ripped off but I believe there&#x27;s still a market for preventing broken bones, spinal snaps, decapitations, and the like.<p>Somehow we still don&#x27;t have GUI HUDs in our moto helmets. Like BMW is working on something but honestly it would be a <i>relatively</i> simple and profitable thing for a <i>very</i> small startup (2 man team working part time). Literally even just casting your smartphone screen to the visor would be enough to get people buying so they can have a HUD map and shit.<p>Big market for motorcycle storage solutions. I giggle whenever I see someone with an ammo box strapped onto their sports bike. We already dropped hundreds on gear and thousands on the bike, we spend many more hundreds or thousands on modding the things, there&#x27;s ample opportunity for more elegant and functional storage solutions.<p>VR allows for limitless desktop screen space in a portable package. I&#x27;d like to be able to bring an HTC vive and a tiny screenless box to plug it into that would allow me to have a &quot;multi-monitor&quot; setup while I travel. Some say the resolution isn&#x27;t there yet, I say make the text bigger. I have no problem reading the stuff in steamVR.<p>I get made fun of every time I bring it up but I&#x27;m convinced people are stupidly ignoring lighter than air travel, transportation, and data distribution, especially in an automated sense. Google has their wifi balloon thing but they dropped their blimp transport truck project. I think it could&#x27;ve been a thing.<p>There may be some margins available in teaching low-income people how to cook and eat basic foods instead of frozen meals. It took me to getting scholarshipped into college to realize that we were losing buckets of money eating frozen meals and fast food because we thought it was the &quot;cheapest option,&quot; not to mention how unhealthy we were for it. Think like somehow getting low-income folks to buy potatoes, onions, peppers, dried beans, cheap cuts of meat, etc and demonstrating how it&#x27;s faster, cheaper, healthier, etc. Potentially a gov funding opportunity, would save on EBT and healthcare costs.<p>Kids learn by doing. Good luck changing anything about education in the USA though.<p>Someone would be able to take over any industry in Taiwan that they please if they start up the company and instantly pay 2x local salary, give PTO, and have other basic benefits that we take for granted here. It wouldn&#x27;t be much, you&#x27;d be paying ~44k&#x2F;year USD for an Engineer, for example. You&#x27;d be able to poach the best talent, you&#x27;d draw shitloads of negative press from pissed of old Taiwanese businesspeople (no press is bad press), everyone would be telling you you&#x27;re wrong, and you&#x27;d Donald Trump your way straight to the top. Think Scranton Oakmont or Gordon Ramsay as well. Just don&#x27;t break the law. Also learn Chinese.",
            "time": 1481315887,
            "type": "comment",
            "id": 13141632,
            "by": "komali2"
        },
        {
            "kids": [
                {
                    "parent": 13141598,
                    "text": "I can sell you a Nokia 1210 if you want",
                    "time": 1481329373,
                    "type": "comment",
                    "id": 13143100,
                    "by": "guftagu"
                },
                {
                    "kids": [
                        {
                            "parent": 13142219,
                            "text": "The ones poorly served by iphones and androids.  The ones that see gadgets as a tool and not an identity. The ones that want to augment their abilities without enslaving themselves.",
                            "time": 1481321379,
                            "type": "comment",
                            "id": 13142291,
                            "by": "0xdeadbeefbabe"
                        }
                    ],
                    "parent": 13141598,
                    "text": "Which industry is that? :)",
                    "time": 1481320791,
                    "type": "comment",
                    "id": 13142219,
                    "by": "aj0strow"
                }
            ],
            "parent": 13139638,
            "text": "A cheap durable texting cel phone with long battery life for use as a pager.<p>Edit: probably without android.",
            "time": 1481315596,
            "type": "comment",
            "id": 13141598,
            "by": "0xdeadbeefbabe"
        },
        {
            "kids": [
                {
                    "parent": 13141778,
                    "text": "Without being P.C., I have to assume you mean poor people. And TBH, I&#x27;ve had the thought that there must be some big opportunity out there to address for that segment. But I have no idea what it might be.<p>I feel they live very differently and would spread ideas among their network when some app&#x2F;service helped their live (cheaper, easier). I have some friends and family that fit into this mold and it&#x27;s obvious they have a different thought process when making financial choices, even simple ones like shopping for groceries, and they depend on things that &gt;=average earners don&#x27;t.<p>And, it seems most of them have smart phones these days. So it&#x27;s probably only a matter of time before something hits big with this group.<p>Most apps are for what many would say are &quot;rich people.&quot; You pay someone to drive you? You pay someone to run your errands? You pay extra for grocery delivery? Eating out is expensive enough, you paid extra to have it delivered?  It&#x27;s for people who can afford convenience. Opportunity cost is not a real thing for poor people because they lack opportunity.",
                    "time": 1481329038,
                    "type": "comment",
                    "id": 13143073,
                    "by": "conductr"
                },
                {
                    "kids": [
                        {
                            "time": 1481320111,
                            "id": 13142138,
                            "parent": 13141978,
                            "deleted": true,
                            "type": "comment"
                        },
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "time": 1481323372,
                                            "id": 13142513,
                                            "parent": 13142453,
                                            "deleted": true,
                                            "type": "comment"
                                        }
                                    ],
                                    "parent": 13142249,
                                    "text": "Sorry but I have no idea who you are or what you are talking about. What kind of market are you referring to?",
                                    "time": 1481322876,
                                    "type": "comment",
                                    "id": 13142453,
                                    "by": "goshx"
                                }
                            ],
                            "parent": 13141978,
                            "text": "I was just answering the OP. With all these downvotes for that I have nothing more to say.",
                            "time": 1481321081,
                            "type": "comment",
                            "id": 13142249,
                            "by": "xiaoma"
                        }
                    ],
                    "parent": 13141778,
                    "text": "Low end of what market? Propose an idea.",
                    "time": 1481318644,
                    "type": "comment",
                    "id": 13141978,
                    "by": "csdreamer7"
                },
                {
                    "parent": 13141778,
                    "text": "Do you have something specific in mind, regarding the low-end of the market?  Maybe a couple of examples?  I&#x27;m really interested in understanding what you mean.",
                    "time": 1481318740,
                    "type": "comment",
                    "id": 13141987,
                    "by": "MaxLegroom"
                }
            ],
            "parent": 13139638,
            "text": "Everyone is ignoring the low-end of the market.",
            "time": 1481317033,
            "type": "comment",
            "id": 13141778,
            "by": "xiaoma"
        },
        {
            "time": 1481316586,
            "id": 13141719,
            "parent": 13139638,
            "deleted": true,
            "type": "comment"
        },
        {
            "time": 1481312968,
            "id": 13141275,
            "parent": 13139638,
            "deleted": true,
            "type": "comment"
        },
        {
            "kids": [
                {
                    "parent": 13141411,
                    "text": "Just going to assume this one needs a &#x2F;sarcasm tag :-)",
                    "time": 1481315624,
                    "type": "comment",
                    "id": 13141603,
                    "by": "sheraz"
                },
                {
                    "parent": 13141411,
                    "text": "I&#x27;ve got a foosball table.",
                    "time": 1481320477,
                    "type": "comment",
                    "id": 13142183,
                    "by": "0xdeadbeefbabe"
                },
                {
                    "dead": true,
                    "parent": 13141411,
                    "text": "Not suggesting this is an end all solution, since CHF can also stem from non diet related issues, but eating a whole food plant based diet can start to reverse heart disease in as little as a few weeks. It can also prevent and reverse many other diet caused&#x2F;related diseases.<p>I think part of the issue has mainly been a lack of education on what a poor diet consists of.<p>If anyone is interested, Dr. Gregor is a great resource of knowledge on this subject. He did a talk at google <a href=\"https:&#x2F;&#x2F;m.youtube.com&#x2F;watch?v=7rNY7xKyGCQ\" rel=\"nofollow\">https:&#x2F;&#x2F;m.youtube.com&#x2F;watch?v=7rNY7xKyGCQ</a> which is based on his book &quot;How Not to Die: Discover the Foods Scientifically Proven to Prevent and Reverse Disease&quot; <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;dp&#x2F;1250066115&#x2F;ref=cm_sw_r_cp_api_bEXsybYE2VWH2\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;dp&#x2F;1250066115&#x2F;ref=cm_sw_r_cp_api_bEXs...</a><p>His website is <a href=\"http:&#x2F;&#x2F;nutritionfacts.org\" rel=\"nofollow\">http:&#x2F;&#x2F;nutritionfacts.org</a><p>All not for profit.",
                    "time": 1481316927,
                    "type": "comment",
                    "id": 13141757,
                    "by": "itsthewrongway"
                }
            ],
            "dead": true,
            "parent": 13139638,
            "text": "Curing congestive heart failure. We&#x27;re not even close. The space is ripe for disruption by a team of Growth Hackers with a foosball table.",
            "time": 1481314058,
            "type": "comment",
            "id": 13141411,
            "by": "kevinskii"
        },
        {
            "kids": [
                {
                    "kids": [
                        {
                            "parent": 13141144,
                            "text": "&gt;<i>I&#x27;m sorry, but this is rude, discouraging, and flat out wrong.</i><p>I&#x27;d rather people feel slighted than to have a bunch of kids fresh out of college trying to disrupt, say, the health insurance industry.<p>This isn&#x27;t about &quot;fresh eyes&quot;.  The problem with having no domain knowledge is that you can&#x27;t identify many of the issues that needs solving within an industry.  Every job I&#x27;ve ever had, I see issues that I can solve with <i>my</i> experience.",
                            "time": 1481313161,
                            "type": "comment",
                            "id": 13141299,
                            "by": "forgetsusername"
                        }
                    ],
                    "parent": 13140682,
                    "text": "I&#x27;m sorry, but this is rude, discouraging, and flat out wrong. This sort of stuff happens all the time. I personally work for a company whose founders implanted them in an incredibly calcified industry despite no industry experience, and I can rattle off dozens of successful examples of this.<p>In fact, this very attitude is the exact reason why there have been industries that are primed for &quot;disruption.&quot; If only those within the industry, burdened with preconceived notions and patterns of thought, try to improve an industry, you are very rarely going to see revolutionary change.<p>You don&#x27;t need to &quot;disrupt&quot; anything to be a very good business, but I really resent this &quot;leave it to the pros&quot; attitude.",
                    "time": 1481311923,
                    "type": "comment",
                    "id": 13141144,
                    "by": "tomtheelder"
                },
                {
                    "parent": 13140682,
                    "text": "I sort of agree. But it is also true that there are many industries and groups that are <i>way</i> behind the state of the art in technology. That may be for good reason, or it may be because it hasn&#x27;t worked for them yet, or may be because it can&#x27;t work, or because they avoid tech, or...umpteen reasons.<p>So yes, a CS grad probably wont come along and revolutionise the Supply Chain industry, but mainly because SC has been at the forefront of areas of tech for decades. A CS grad may, however, come along and revolutionise...well just look at all of the recent famous tech companies...communications, travel, social, arts and crafts...whatever. Many areas are ripe for fresh eyes and new approaches.<p>I do agree that domain knowledge is often massively under-emphasised though.",
                    "time": 1481318428,
                    "type": "comment",
                    "id": 13141951,
                    "by": "anjc"
                },
                {
                    "kids": [
                        {
                            "parent": 13141269,
                            "text": "And there&#x27;s nothing precluding someone in the industry from being a part of that team, to bring understanding of the problem space.",
                            "time": 1481315431,
                            "type": "comment",
                            "id": 13141573,
                            "by": "pavel_lishin"
                        },
                        {
                            "kids": [
                                {
                                    "kids": [
                                        {
                                            "kids": [
                                                {
                                                    "kids": [
                                                        {
                                                            "parent": 13141487,
                                                            "text": "If your expertise is organizational and can put together the right team with those that <i>do</i> have the domain knowledge, I&#x27;ll concede the point. But domain knowledge is irreplaceable if you actually want to solve hard problems with scalable markets.",
                                                            "time": 1481315456,
                                                            "type": "comment",
                                                            "id": 13141576,
                                                            "by": "saosebastiao"
                                                        }
                                                    ],
                                                    "parent": 13141465,
                                                    "text": "Yes exactly.<p>Often they don&#x27;t have the tech skills or desire&#x2F;will to start something themselves, but are happy to join you if they recognize that it&#x27;s a big enough problem.",
                                                    "time": 1481314772,
                                                    "type": "comment",
                                                    "id": 13141487,
                                                    "by": "AndrewKemendo"
                                                }
                                            ],
                                            "parent": 13141417,
                                            "text": "So hire people that already know the industry?",
                                            "time": 1481314573,
                                            "type": "comment",
                                            "id": 13141465,
                                            "by": "saosebastiao"
                                        }
                                    ],
                                    "parent": 13141372,
                                    "text": "See step 1 and 2.",
                                    "time": 1481314072,
                                    "type": "comment",
                                    "id": 13141417,
                                    "by": "AndrewKemendo"
                                }
                            ],
                            "parent": 13141269,
                            "text": "How can you solve a problem that you can&#x27;t adequately analyze or characterize? How will you know if you aren&#x27;t trying a failed solution if you don&#x27;t know what has been tried? How will you know if your simplifications and assumptions are realistic if you haven&#x27;t seen how they&#x27;ve played out in the past?",
                            "time": 1481313757,
                            "type": "comment",
                            "id": 13141372,
                            "by": "saosebastiao"
                        }
                    ],
                    "parent": 13140682,
                    "text": "<i>The idea that someone who knows how to code can disrupt an industry that they are not a part of is disingenuous</i><p>Uh, no. The idea is that you identify the problem, build the team to solve it, build something quick that can prove that you can solve it in a better way than others, iterate to the point that CAC &lt; LTV, scale.",
                    "time": 1481312923,
                    "type": "comment",
                    "id": 13141269,
                    "by": "AndrewKemendo"
                },
                {
                    "parent": 13140682,
                    "text": "As a former architect, that&#x27;s what domain experts and workshops are for.",
                    "time": 1481316669,
                    "type": "comment",
                    "id": 13141728,
                    "by": "ImTalking"
                },
                {
                    "parent": 13140682,
                    "text": "before reading the comments i would have agreed but man.. there really are a lot of juicy suggestions.. not just trivial ideas like another travel app.",
                    "time": 1481327707,
                    "type": "comment",
                    "id": 13142959,
                    "by": "AznHisoka"
                },
                {
                    "parent": 13140682,
                    "text": "This just as wrong as anything can be and you have nothing to back it up. Furthermore you seem to have missed why they are asked. The problems in many industries er hidden problems which can only be understood by those in the industry, but the solutions are often made by people outside the industries in partnership with insighters.<p>So they are imensly useful and many time more relevant than most other discussions about building companies.",
                    "time": 1481312670,
                    "type": "comment",
                    "id": 13141236,
                    "by": "ThomPete"
                }
            ],
            "parent": 13139638,
            "text": "These questions pop up every now and then, and while I get the intent, you&#x27;re not gonna get anything useful out of it. The idea that someone who knows how to code can disrupt an industry that they are not a part of is disingenuous, and the examples that you can find are exceptions, not the rule. It&#x27;s also extremely naive and presumptuous...what makes you think people in the industry haven&#x27;t already tried? People who fall ill to this delusion end up in one of two categories: those that attack easy problems with tiny markets, and those that attack hard problems and spend decades learning about and becoming a part of the industry before they solve them.<p>As someone in the supply chain and logistics industry, I can list for you hundreds of people that know the traveling salesman problem and precisely why its not applicable to their situation. I know hundreds of people that already know how to better manage their safety stock than someone who suggests using Gaussian demand models. I know hundreds of people who can optimize last mile delivery costs orders of magnitude better than a drone engineer. I know hundreds of people who can manage inventory distribution and ordering automation better than someone who knows databases.<p>And sure, there are companies out there that are doing everything ass backwards and could use some help, even if it is primitive and simplistic. And when they decide to look for it, who are they gonna choose: the guy who saved Amazon $500M&#x2F;year with their truck load optimization expertise, or you, with your shiny website and a trick you learned from a textbook?<p>So as a piece of advice, if you aren&#x27;t part of the industry already, don&#x27;t try to do B2B in that industry. B2C is fine, because as a consumer you are ostensibly a part of the industry...but B2B is a death march.",
            "time": 1481308332,
            "type": "comment",
            "id": 13140682,
            "by": "saosebastiao"
        }
    ],
    "score": 285,
    "descendants": 376,
    "title": "Ask HN: What problem in your industry is a potential startup?",
    "time": 1481300744,
    "type": "story",
    "id": 13139638,
    "by": "takinola"
}